window.QUESTIONS = [
  {
    "id": "T1Q1",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 1,
    "prompt": "Какими отличительными особенностями обладают цифровые активы относительно материальных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Цифровой актив может быть воспроизведен бесконечно и с идеальной точностью"
      },
      {
        "key": "Б",
        "text": "Дополнительные единицы цифрового актива могут быть произведены практически с нулевыми издержками"
      },
      {
        "key": "В",
        "text": "Цифровой актив можно передавать почти моментально и без издержек"
      },
      {
        "key": "Г",
        "text": "Создание цифрового актива не требует финансовых вложений"
      },
      {
        "key": "Д",
        "text": "Цифровой актив представляется исключительно на магнитном носителе"
      }
    ],
    "explanation": "Правильный ответ: А) Цифровой актив может быть воспроизведен бесконечно и с идеальной точностью; Б) Дополнительные единицы цифрового актива могут быть произведены практически с нулевыми издержками; В) Цифровой актив можно передавать почти моментально и без издержек"
  },
  {
    "id": "T1Q2",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 2,
    "prompt": "Какие технологии соответствуют промышленным революциям?",
    "sourceType": "Сопоставьте значения колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Индустрия 1.0",
        "right": "Механизация производства на базе воды и пара"
      },
      {
        "key": "Б",
        "left": "Индустрия 2.0",
        "right": "Массовое производство, электричество, разделение труда"
      },
      {
        "key": "В",
        "left": "Индустрия 3.0",
        "right": "Автоматизация производства, внедрение IT-систем и электроники"
      },
      {
        "key": "Г",
        "left": "Индустрия 4.0",
        "right": "Киберфизические производственные системы"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T1Q3",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 3,
    "prompt": "В какой последовательности развивались технологии (от старых к современным)?",
    "sourceType": "Расположите в нужном порядке",
    "type": "order",
    "options": [
      {
        "key": "А",
        "text": "Механизация производства на базе воды и пара"
      },
      {
        "key": "Б",
        "text": "Массовое производство, электричество, разделение труда"
      },
      {
        "key": "В",
        "text": "Автоматизация производства, внедрение IT-систем и электроники"
      },
      {
        "key": "Г",
        "text": "Киберфизические производственные системы"
      }
    ],
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "explanation": "Правильная последовательность: А → Б → В → Г. "
  },
  {
    "id": "T1Q4",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 4,
    "prompt": "Какие есть факторы риска по эффективному использованию данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Рост объемов обрабатываемых данных опережает развитие методологии управления данными"
      },
      {
        "key": "Б",
        "text": "Недостаточная эффективность программ подготовки специалистов по управлению данными"
      },
      {
        "key": "В",
        "text": "Развитие экономики фрагментировано и комплексно не рассматривают вопросы управления данными"
      },
      {
        "key": "Г",
        "text": "Индустрия 4.0 не рассматривает управление данными, как элемента управления производством"
      },
      {
        "key": "Д",
        "text": "Применение искусственного интеллекта снижает качество обработки больших объемов данных"
      }
    ],
    "explanation": "Правильный ответ: А) Рост объемов обрабатываемых данных опережает развитие методологии управления данными; Б) Недостаточная эффективность программ подготовки специалистов по управлению данными; В) Развитие экономики фрагментировано и комплексно не рассматривают вопросы управления данными"
  },
  {
    "id": "T1Q5",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 5,
    "prompt": "Какие основные элементы включаются в систему управления данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Организационная структура"
      },
      {
        "key": "Б",
        "text": "Процессы, практики и подходы"
      },
      {
        "key": "В",
        "text": "Участники, взаимодействующие с данными"
      },
      {
        "key": "Г",
        "text": "Нейросети и программы принятия решений"
      },
      {
        "key": "Д",
        "text": "Оборудование для обработки данных"
      }
    ],
    "explanation": "Правильный ответ: А) Организационная структура; Б) Процессы, практики и подходы; В) Участники, взаимодействующие с данными"
  },
  {
    "id": "T1Q6",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 6,
    "prompt": "Что включается в инфраструктуру управления данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Программно-аппаратные комплексы обработки данных"
      },
      {
        "key": "Б",
        "text": "Системы обеспечения доступности данных"
      },
      {
        "key": "В",
        "text": "Системы обеспечения качества данных"
      },
      {
        "key": "Г",
        "text": "Системы искусственного интеллекта"
      },
      {
        "key": "Д",
        "text": "Обрабатываемые данных"
      }
    ],
    "explanation": "Правильный ответ: А) Программно-аппаратные комплексы обработки данных; Б) Системы обеспечения доступности данных; В) Системы обеспечения качества данных"
  },
  {
    "id": "T1Q7",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 7,
    "prompt": "Какой этап работы с данными требуется наибольшего времени работы специалистов в области искусственного интеллекта и машинного обучения?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Подготовка данных"
      },
      {
        "key": "Б",
        "text": "Сбор данных"
      },
      {
        "key": "В",
        "text": "Публикация данных"
      },
      {
        "key": "Г",
        "text": "Обучение моделей"
      },
      {
        "key": "Д",
        "text": "Удаление данных"
      }
    ],
    "explanation": "Правильный ответ: А) Подготовка данных"
  },
  {
    "id": "T1Q8",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 8,
    "prompt": "Какие действия ад данными необходимо проводить при подготовке данных к использованию в искусственном интеллекте?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Очистка данных"
      },
      {
        "key": "Б",
        "text": "Заполнение пропусков"
      },
      {
        "key": "В",
        "text": "Форматирование данных"
      },
      {
        "key": "Г",
        "text": "Отбор признаков"
      },
      {
        "key": "Д",
        "text": "Агрегирование данных"
      }
    ],
    "explanation": "Правильный ответ: А) Очистка данных; Б) Заполнение пропусков; В) Форматирование данных; Г) Отбор признаков; Д) Агрегирование данных"
  },
  {
    "id": "T1Q9",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 9,
    "prompt": "Какие действия с данными необходимо проводить в процессе сбора данных для использования в искусственном интеллекте?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Идентификация источников"
      },
      {
        "key": "Б",
        "text": "Получение доступов"
      },
      {
        "key": "В",
        "text": "Загрузка данных"
      },
      {
        "key": "Г",
        "text": "Очистка данных"
      },
      {
        "key": "Д",
        "text": "Трансформация данных"
      }
    ],
    "explanation": "Правильный ответ: А) Идентификация источников; Б) Получение доступов; В) Загрузка данных"
  },
  {
    "id": "T1Q10",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 10,
    "prompt": "Какие цели преследует управление данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Выявление и обслуживание информационных потребностей"
      },
      {
        "key": "Б",
        "text": "Обеспечение качества данных"
      },
      {
        "key": "В",
        "text": "Предотвращение несанкционированного доступа к данным"
      },
      {
        "key": "Г",
        "text": "Сбор данных для принятия решений"
      },
      {
        "key": "Д",
        "text": "Построение систем искусственного интеллекта"
      }
    ],
    "explanation": "Правильный ответ: А) Выявление и обслуживание информационных потребностей; Б) Обеспечение качества данных; В) Предотвращение несанкционированного доступа к данным; Г) Сбор данных для принятия решений"
  },
  {
    "id": "T1Q11",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 11,
    "prompt": "Что необходимо для того, чтобы данные соответствовали требованиям бизнеса?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Управлять качеством данных"
      },
      {
        "key": "Б",
        "text": "Управлять метаданными"
      },
      {
        "key": "В",
        "text": "Потребности бизнеса определяют ИТ ландшафт"
      },
      {
        "key": "Г",
        "text": "ИТ решения ограничивают управление данными"
      },
      {
        "key": "Д",
        "text": "Собирать все данных, которые окружают бизнес"
      }
    ],
    "explanation": "Правильный ответ: А) Управлять качеством данных; Б) Управлять метаданными; В) Потребности бизнеса определяют ИТ ландшафт"
  },
  {
    "id": "T1Q12",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 12,
    "prompt": "Какие задачи выполняются при управлении данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Построение архитектуры данных"
      },
      {
        "key": "Б",
        "text": "Анализ и модификация бизнес-процессов"
      },
      {
        "key": "В",
        "text": "Классификация и категоризация данных"
      },
      {
        "key": "Г",
        "text": "Разработка нормативной и методологической документации"
      },
      {
        "key": "Д",
        "text": "Производство новых данных"
      }
    ],
    "explanation": "Правильный ответ: А) Построение архитектуры данных; Б) Анализ и модификация бизнес-процессов; В) Классификация и категоризация данных; Г) Разработка нормативной и методологической документации"
  },
  {
    "id": "T1Q13",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 13,
    "prompt": "Какие основные информационные потребности бизнес-стратегии рассматриваются в стратегии управления данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Требуемые данные для организации"
      },
      {
        "key": "Б",
        "text": "Способы и технологии получения данных"
      },
      {
        "key": "В",
        "text": "Возможности использования данных"
      },
      {
        "key": "Г",
        "text": "Форматы представления данных"
      },
      {
        "key": "Д",
        "text": "Способы обеспечения качества данных"
      }
    ],
    "explanation": "Правильный ответ: А) Требуемые данные для организации; Б) Способы и технологии получения данных; В) Возможности использования данных; Г) Форматы представления данных; Д) Способы обеспечения качества данных"
  },
  {
    "id": "T1Q14",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 14,
    "prompt": "Что является бизнес-драйверами управления данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Повышение эффективности управленческих решений"
      },
      {
        "key": "Б",
        "text": "Автоматизация процессов"
      },
      {
        "key": "В",
        "text": "Снижение издержек"
      },
      {
        "key": "Г",
        "text": "Построение нейросетей"
      },
      {
        "key": "Д",
        "text": "Снижение стоимости услуг для клиентов"
      }
    ],
    "explanation": "Правильный ответ: А) Повышение эффективности управленческих решений; Б) Автоматизация процессов; В) Снижение издержек"
  },
  {
    "id": "T1Q15",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 15,
    "prompt": "Какие задачи должны решаться на 2 фазе согласно Пирамиде Айкена?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Построение архитектуры данных"
      },
      {
        "key": "Б",
        "text": "Обеспечение качества данных"
      },
      {
        "key": "В",
        "text": "Создание метаданных"
      },
      {
        "key": "Г",
        "text": "Обеспечение безопасности данных"
      },
      {
        "key": "Д",
        "text": "Построение моделей данных"
      }
    ],
    "explanation": "Правильный ответ: Б) Обеспечение качества данных; В) Создание метаданных; Г) Обеспечение безопасности данных"
  },
  {
    "id": "T1Q16",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 16,
    "prompt": "Какие основные функции выполняет организация DAMA International?",
    "sourceType": "Выберите один правильный ответов",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Разработка и развитие рекомендаций в области управления данными"
      },
      {
        "key": "Б",
        "text": "Создание стандартов качества данных и моделей управления данными"
      },
      {
        "key": "В",
        "text": "Разработка программных продуктов по управлению данными"
      },
      {
        "key": "Г",
        "text": "Популяризация и продвижение решений в области управления данными"
      },
      {
        "key": "Д",
        "text": "Стандартизация форматов данных и технологий их трансформации"
      }
    ],
    "explanation": "Правильный ответ: А) Разработка и развитие рекомендаций в области управления данными"
  },
  {
    "id": "T1Q17",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 17,
    "prompt": "Что входит в стратегию управления данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Показатели успешности управления данными"
      },
      {
        "key": "Б",
        "text": "Описание ролей и организационной структуры"
      },
      {
        "key": "В",
        "text": "Приоритетная программа работ по управлению данными"
      },
      {
        "key": "Г",
        "text": "Дорожная карта проектов и мероприятий"
      },
      {
        "key": "Д",
        "text": "Способы обеспечение безопасности данных"
      }
    ],
    "explanation": "Правильный ответ: А) Показатели успешности управления данными; Б) Описание ролей и организационной структуры; В) Приоритетная программа работ по управлению данными; Г) Дорожная карта проектов и мероприятий; Д) Способы обеспечение безопасности данных"
  },
  {
    "id": "T1Q18",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 18,
    "prompt": "Чем определяются требования к жизненному циклу данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Потребностями бизнеса"
      },
      {
        "key": "Б",
        "text": "Бюджетными ограничениями"
      },
      {
        "key": "В",
        "text": "Ограничения в законодательстве"
      },
      {
        "key": "Г",
        "text": "Программно-аппаратным комплектом"
      },
      {
        "key": "Д",
        "text": "Форматами обрабатываемых данных"
      }
    ],
    "explanation": "Правильный ответ: А) Потребностями бизнеса; Б) Бюджетными ограничениями; В) Ограничения в законодательстве; Г) Программно-аппаратным комплектом; Д) Форматами обрабатываемых данных"
  },
  {
    "id": "T1Q19",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 19,
    "prompt": "Какими уникальными свойствами обладают данные?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Неисчерпаемость"
      },
      {
        "key": "Б",
        "text": "Малые издержки передачи"
      },
      {
        "key": "В",
        "text": "Сомоподдерживающийся рост"
      },
      {
        "key": "Г",
        "text": "Высокая полезность для бизнеса"
      },
      {
        "key": "Д",
        "text": "Применимость в моделях искусственного интеллекта"
      }
    ],
    "explanation": "Правильный ответ: А) Неисчерпаемость; Б) Малые издержки передачи; В) Сомоподдерживающийся рост"
  },
  {
    "id": "T1Q20",
    "topic": 1,
    "topicTitle": "Введение в управление данными",
    "number": 20,
    "prompt": "На каких принципах строится система управления данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Данные имеют ценность"
      },
      {
        "key": "Б",
        "text": "Требования к управлению данными являются бизнес-требованиями"
      },
      {
        "key": "В",
        "text": "Управление данными – это управление их жизненным циклом"
      },
      {
        "key": "Г",
        "text": "Ценность данных соответствует прибыльности бизнеса"
      },
      {
        "key": "Д",
        "text": "Наличие неограниченных технических ресурсов для управления данными"
      }
    ],
    "explanation": "Правильный ответ: А) Данные имеют ценность; Б) Требования к управлению данными являются бизнес-требованиями; В) Управление данными – это управление их жизненным циклом"
  },
  {
    "id": "T2Q1",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 1,
    "prompt": "Какие виды функций включает в себя Руководство данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Планирование"
      },
      {
        "key": "Б",
        "text": "Мониторинг"
      },
      {
        "key": "В",
        "text": "Обеспечение исполнения"
      },
      {
        "key": "Г",
        "text": "Разработка"
      },
      {
        "key": "Д",
        "text": "Тестирование"
      }
    ],
    "explanation": "Правильный ответ: А) Планирование; Б) Мониторинг; В) Обеспечение исполнения"
  },
  {
    "id": "T2Q2",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 2,
    "prompt": "Что включает в себя Система управления данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Процессы"
      },
      {
        "key": "Б",
        "text": "Люди"
      },
      {
        "key": "В",
        "text": "Организационная структура"
      },
      {
        "key": "Г",
        "text": "Технологии"
      },
      {
        "key": "Д",
        "text": "Документация"
      }
    ],
    "explanation": "Правильный ответ: А) Процессы; Б) Люди; В) Организационная структура; Г) Технологии; Д) Документация"
  },
  {
    "id": "T2Q3",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 3,
    "prompt": "Как называется направление руководства данными, включающее наблюдение, аудит и исправление выявленных недостатков в процессах управления данными?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Надзор"
      },
      {
        "key": "Б",
        "text": "Стратегия"
      },
      {
        "key": "В",
        "text": "Политика"
      },
      {
        "key": "Г",
        "text": "Стандарты"
      },
      {
        "key": "Д",
        "text": "Нормативно-правовое соответствие"
      }
    ],
    "explanation": "Правильный ответ: А) Надзор"
  },
  {
    "id": "T2Q4",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 4,
    "prompt": "Как называется направление руководства данными, включающее внедрение стандартов и процессов, позволяющих определить ценность данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Оценка информационных активов"
      },
      {
        "key": "Б",
        "text": "Проектное управление"
      },
      {
        "key": "В",
        "text": "Стратегия"
      },
      {
        "key": "Г",
        "text": "Политика"
      },
      {
        "key": "Д",
        "text": "Стандарты"
      }
    ],
    "explanation": "Правильный ответ: А) Оценка информационных активов"
  },
  {
    "id": "T2Q5",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 5,
    "prompt": "Как называется направление руководства данными, включающее разработку и обеспечение исполнения правил в отношении управления, доступа, использования, безопасности и качества данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Политика"
      },
      {
        "key": "Б",
        "text": "Стратегия"
      },
      {
        "key": "В",
        "text": "Стандарты"
      },
      {
        "key": "Г",
        "text": "Управление рисками и проблемами"
      },
      {
        "key": "Д",
        "text": "Нормативно-правовое соответствие"
      }
    ],
    "explanation": "Правильный ответ: А) Политика"
  },
  {
    "id": "T2Q6",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 6,
    "prompt": "Какие основные типы организационных структур используются при управлении данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Функциональная"
      },
      {
        "key": "Б",
        "text": "Матричная"
      },
      {
        "key": "В",
        "text": "Смешанная"
      },
      {
        "key": "Г",
        "text": "Информационная"
      },
      {
        "key": "Д",
        "text": "Динамическая"
      }
    ],
    "explanation": "Правильный ответ: А) Функциональная; Б) Матричная; В) Смешанная"
  },
  {
    "id": "T2Q7",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 7,
    "prompt": "Что определяет организационная структура?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Структуру управления"
      },
      {
        "key": "Б",
        "text": "Потоки коммуникаций"
      },
      {
        "key": "В",
        "text": "Обязанности сотрудников"
      },
      {
        "key": "Г",
        "text": "Полномочия сотрудников"
      },
      {
        "key": "Д",
        "text": "Обрабатываемые данные"
      }
    ],
    "explanation": "Правильный ответ: А) Структуру управления; Б) Потоки коммуникаций; В) Обязанности сотрудников; Г) Полномочия сотрудников"
  },
  {
    "id": "T2Q8",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 8,
    "prompt": "Какие виды операционных моделей руководства данными реализуются в системе управления данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Централизованная"
      },
      {
        "key": "Б",
        "text": "Реплицируемая"
      },
      {
        "key": "В",
        "text": "Федеративная"
      },
      {
        "key": "Г",
        "text": "Коммуникационная"
      },
      {
        "key": "Д",
        "text": "Информационная"
      }
    ],
    "explanation": "Правильный ответ: А) Централизованная; Б) Реплицируемая; В) Федеративная"
  },
  {
    "id": "T2Q9",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 9,
    "prompt": "В чем заключается особенность реализации централизованной операционной модели руководства данными?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Единая структура контролирует все работы по всем предметным областям данных"
      },
      {
        "key": "Б",
        "text": "Каждая бизнес-единица самостоятельно реализует руководство данными"
      },
      {
        "key": "В",
        "text": "Единый центр координирует операционную работу бизнес-единиц в части данных"
      },
      {
        "key": "Г",
        "text": "Бизнес-единицы коллегиально формируют политику управления данными"
      },
      {
        "key": "Д",
        "text": "Для каждой предметной области формируется своя система руководства данными"
      }
    ],
    "explanation": "Правильный ответ: А) Единая структура контролирует все работы по всем предметным областям данных"
  },
  {
    "id": "T2Q10",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 10,
    "prompt": "В чем заключается особенность реализации реплицируемой операционной модели руководства данными?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Каждая бизнес-единица самостоятельно реализует руководство данными"
      },
      {
        "key": "Б",
        "text": "Единая структура контролирует все работы по всем предметным областям данных"
      },
      {
        "key": "В",
        "text": "Единый центр координирует операционную работу бизнес-единиц в части данных"
      },
      {
        "key": "Г",
        "text": "Бизнес-единицы коллегиально формируют политику управления данными"
      },
      {
        "key": "Д",
        "text": "Для каждой предметной области формируется своя система руководства данными"
      }
    ],
    "explanation": "Правильный ответ: А) Каждая бизнес-единица самостоятельно реализует руководство данными"
  },
  {
    "id": "T2Q11",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 11,
    "prompt": "В чем заключается особенность реализации федеративной операционной модели руководства данными?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Единый центр координирует операционную работу бизнес-единиц в части данных"
      },
      {
        "key": "Б",
        "text": "Каждая бизнес-единица самостоятельно реализует руководство данными"
      },
      {
        "key": "В",
        "text": "Единая структура контролирует все работы по всем предметным областям данных"
      },
      {
        "key": "Г",
        "text": "Бизнес-единицы коллегиально формируют политику управления данными"
      },
      {
        "key": "Д",
        "text": "Для каждой предметной области формируется своя система руководства данными"
      }
    ],
    "explanation": "Правильный ответ: А) Единый центр координирует операционную работу бизнес-единиц в части данных"
  },
  {
    "id": "T2Q12",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 12,
    "prompt": "Какие основные функции у CDO (Chief Data Officer)?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Организует разработку политик, процессов, стандартов работы с данными"
      },
      {
        "key": "Б",
        "text": "Курирует и возглавляет проекты, направленные на совершенствование системы управления данными"
      },
      {
        "key": "В",
        "text": "Формирует корпоративную культуру в области управления данными"
      },
      {
        "key": "Г",
        "text": "Определяет периметры предметных областей данных"
      },
      {
        "key": "Д",
        "text": "Проектирует и внедряет проверки качества данных"
      }
    ],
    "explanation": "Правильный ответ: А) Организует разработку политик, процессов, стандартов работы с данными; Б) Курирует и возглавляет проекты, направленные на совершенствование системы управления данными; В) Формирует корпоративную культуру в области управления данными"
  },
  {
    "id": "T2Q13",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 13,
    "prompt": "Какие основные функции у архитектора данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Разрабатывает стандарты моделирования данных"
      },
      {
        "key": "Б",
        "text": "Определяет периметры предметных областей данных"
      },
      {
        "key": "В",
        "text": "Руководит работами в рамках процессов управления данными"
      },
      {
        "key": "Г",
        "text": "Проектирует и разрабатывает проверки качества данных"
      },
      {
        "key": "Д",
        "text": "Отслеживает исполнение стандартов обработки данных"
      }
    ],
    "explanation": "Правильный ответ: А) Разрабатывает стандарты моделирования данных; Б) Определяет периметры предметных областей данных"
  },
  {
    "id": "T2Q14",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 14,
    "prompt": "Какие основные функции у дата-стюарда?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Выявляет и регистрирует инциденты качества данных"
      },
      {
        "key": "Б",
        "text": "Осуществляет мониторинг качества данных"
      },
      {
        "key": "В",
        "text": "Отслеживает исполнение стандартов обработки данных"
      },
      {
        "key": "Г",
        "text": "Проектирует, разрабатывает и внедряет проверки качества данных"
      },
      {
        "key": "Д",
        "text": "Выполняет аудит качества данных"
      }
    ],
    "explanation": "Правильный ответ: А) Выявляет и регистрирует инциденты качества данных; Б) Осуществляет мониторинг качества данных; В) Отслеживает исполнение стандартов обработки данных; Д) Выполняет аудит качества данных"
  },
  {
    "id": "T2Q15",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 15,
    "prompt": "Какие основные функции у аналитика данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Проектирует, разрабатывает и внедряет проверки качества данных"
      },
      {
        "key": "Б",
        "text": "Формирует отчетность по качеству данных"
      },
      {
        "key": "В",
        "text": "Разрабатывает и актуализирует методологию управления данными"
      },
      {
        "key": "Г",
        "text": "Выполняет разработку политик, процессов, стандартов, регламентов работы с данными"
      },
      {
        "key": "Д",
        "text": "Отслеживает исполнение стандартов обработки данных"
      }
    ],
    "explanation": "Правильный ответ: А) Проектирует, разрабатывает и внедряет проверки качества данных; Б) Формирует отчетность по качеству данных"
  },
  {
    "id": "T2Q16",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 16,
    "prompt": "Какие функции выполняются в соответствующих ролях?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "CDO",
        "right": "Курирует и возглавляет проекты, направленные на совершенствование системы управления данными"
      },
      {
        "key": "Б",
        "left": "Дата-стюард",
        "right": "Осуществляет мониторинг качества данных"
      },
      {
        "key": "В",
        "left": "Аналитик данных",
        "right": "Проектирует, разрабатывает и внедряет проверки качества данных"
      },
      {
        "key": "Г",
        "left": "Архитектор данных",
        "right": "Определяет периметры предметных областей данных"
      },
      {
        "key": "Д",
        "left": "Техническая команда",
        "right": "Обеспечивает интеграцию автоматизированных систем контура управления данными с прочими системами"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T2Q17",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 17,
    "prompt": "Что из перечисленного является вводными для формализации процессов управления данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Утвержденная стратегия управления данными"
      },
      {
        "key": "Б",
        "text": "Выбранная операционная модель управления данными"
      },
      {
        "key": "В",
        "text": "Имеющиеся ресурсы"
      },
      {
        "key": "Г",
        "text": "Ролевая модель управления данными"
      },
      {
        "key": "Д",
        "text": "имеющееся разделение данных по предметным областям"
      }
    ],
    "explanation": "Правильный ответ: А) Утвержденная стратегия управления данными; Б) Выбранная операционная модель управления данными; В) Имеющиеся ресурсы; Г) Ролевая модель управления данными; Д) имеющееся разделение данных по предметным областям"
  },
  {
    "id": "T2Q18",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 18,
    "prompt": "Какие основные функции каталога данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Классификация метаданных"
      },
      {
        "key": "Б",
        "text": "Ведение КМД (корпоративной модели данных)"
      },
      {
        "key": "В",
        "text": "Управление глоссарием данных"
      },
      {
        "key": "Г",
        "text": "Управление связями между данными"
      },
      {
        "key": "Д",
        "text": "Интеграция с корпоративными системами"
      }
    ],
    "explanation": "Правильный ответ: А) Классификация метаданных; В) Управление глоссарием данных; Г) Управление связями между данными; Д) Интеграция с корпоративными системами"
  },
  {
    "id": "T2Q19",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 19,
    "prompt": "Какие основные функции в системе мониторинга качества данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Предотвращение ошибок на этапе ввода данных"
      },
      {
        "key": "Б",
        "text": "Выявление ошибок в массивах консолидированных данных"
      },
      {
        "key": "В",
        "text": "Регистрация инцидентов качества данных"
      },
      {
        "key": "Г",
        "text": "Выявление причины возникновения ошибки в данных"
      },
      {
        "key": "Д",
        "text": "Сканирование источников данных и сбор метаданных"
      }
    ],
    "explanation": "Правильный ответ: Б) Выявление ошибок в массивах консолидированных данных; В) Регистрация инцидентов качества данных; Г) Выявление причины возникновения ошибки в данных"
  },
  {
    "id": "T2Q20",
    "topic": 2,
    "topicTitle": "Руководство данными",
    "number": 20,
    "prompt": "Какие функции выполняются в соответствующих системах?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Система управления мастер-данными",
        "right": "Централизация и консолидация данных из различных источников"
      },
      {
        "key": "Б",
        "left": "Каталог данных",
        "right": "Автоматическое сканирование источников и сбор метаданных"
      },
      {
        "key": "В",
        "left": "Система мониторинга качества данных",
        "right": "Создание и управление библиотекой контролей качества данных"
      },
      {
        "key": "Г",
        "left": "Система управления инцидентами",
        "right": "фиксация данных о проблеме в данных"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T3Q1",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 1,
    "prompt": "Какими основными понятиями и концепциями оперирует архитектура данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Предметные области архитектуры предприятия"
      },
      {
        "key": "Б",
        "text": "Архитектурные рамочные структуры"
      },
      {
        "key": "В",
        "text": "Корпоративная архитектура данных"
      },
      {
        "key": "Г",
        "text": "Технологическая архитектура предприятия"
      },
      {
        "key": "Д",
        "text": "Бизнес-архитектура предприятия"
      }
    ],
    "explanation": "Правильный ответ: А) Предметные области архитектуры предприятия; Б) Архитектурные рамочные структуры; В) Корпоративная архитектура данных; Г) Технологическая архитектура предприятия; Д) Бизнес-архитектура предприятия"
  },
  {
    "id": "T3Q2",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 2,
    "prompt": "В контексте каких предметных областей (доменов) выстраивается архитектура данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Бизнес-архитектура предприятия"
      },
      {
        "key": "Б",
        "text": "Архитектура приложений предприятия"
      },
      {
        "key": "В",
        "text": "Технологическая архитектура предприятия"
      },
      {
        "key": "Г",
        "text": "Корпоративная архитектура данных"
      },
      {
        "key": "Д",
        "text": "Архитектура зданий и сооружений"
      }
    ],
    "explanation": "Правильный ответ: А) Бизнес-архитектура предприятия; Б) Архитектура приложений предприятия; В) Технологическая архитектура предприятия; Г) Корпоративная архитектура данных"
  },
  {
    "id": "T3Q3",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 3,
    "prompt": "Какое назначение архитектуры данных предприятия?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Описание организации данных и осуществления управления данными"
      },
      {
        "key": "Б",
        "text": "Выявление путей движения данных и создания ценности для потребителей"
      },
      {
        "key": "В",
        "text": "Описание структуры и функциональности используемых на предприятии приложений"
      },
      {
        "key": "Г",
        "text": "Описание технологической инфраструктуры, используемой при работе с данными"
      },
      {
        "key": "Д",
        "text": "Описание последовательности реализации приложений по работе с данными"
      }
    ],
    "explanation": "Правильный ответ: А) Описание организации данных и осуществления управления данными"
  },
  {
    "id": "T3Q4",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 4,
    "prompt": "Какие элементы включаются в архитектуру данных предприятия?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Спецификации отображения данных"
      },
      {
        "key": "Б",
        "text": "Интерфейсы прикладных программ"
      },
      {
        "key": "В",
        "text": "Бизнес-модели"
      },
      {
        "key": "Г",
        "text": "Технические платформы"
      },
      {
        "key": "Д",
        "text": "Сервисы и события"
      }
    ],
    "explanation": "Правильный ответ: А) Спецификации отображения данных; Б) Интерфейсы прикладных программ; Г) Технические платформы; Д) Сервисы и события"
  },
  {
    "id": "T3Q5",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 5,
    "prompt": "Какие роли определяются в рамках реализации архитектуры данных предприятия?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Специалисты по разработке моделей данных"
      },
      {
        "key": "Б",
        "text": "Распорядители данных"
      },
      {
        "key": "В",
        "text": "Бизнес-архитекторы"
      },
      {
        "key": "Г",
        "text": "Архитекторы приложений"
      },
      {
        "key": "Д",
        "text": "Архитекторы инфраструктуры"
      }
    ],
    "explanation": "Правильный ответ: А) Специалисты по разработке моделей данных; Б) Распорядители данных; В) Бизнес-архитекторы; Г) Архитекторы приложений; Д) Архитекторы инфраструктуры"
  },
  {
    "id": "T3Q6",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 6,
    "prompt": "Что собой представляет модель Захмана?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Совокупность моделей, описывающих предприятие, и связей между ними"
      },
      {
        "key": "Б",
        "text": "Процесс разработки моделей на уровне различных предметных областей (доменов)"
      },
      {
        "key": "В",
        "text": "Список терминов и определений, используемых в архитектурах предприятия"
      },
      {
        "key": "Г",
        "text": "Распределение обязанностей по ролям, реализуемым при управлении данными"
      },
      {
        "key": "Д",
        "text": "Подход к оценке полноты покрытия деятельности предприятия перечисленными моделями"
      }
    ],
    "explanation": "Правильный ответ: А) Совокупность моделей, описывающих предприятие, и связей между ними"
  },
  {
    "id": "T3Q7",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 7,
    "prompt": "Сопоставьте вопросы и соответствующими им элементы согласно модели Захмана?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Что?",
        "right": "Объекты"
      },
      {
        "key": "Б",
        "left": "Как?",
        "right": "Процессы"
      },
      {
        "key": "В",
        "left": "Где?",
        "right": "Местоположение"
      },
      {
        "key": "Г",
        "left": "Кто?",
        "right": "Обязанности"
      },
      {
        "key": "Д",
        "left": "Когда?",
        "right": "Привязка ко времени"
      },
      {
        "key": "Е",
        "left": "Зачем?",
        "right": "Мотивация"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T3Q8",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 8,
    "prompt": "Сопоставьте роли и соответствующие им уровни реализации архитектуры согласно модели Захмана?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Руководство",
        "right": "Бизнес-контекст"
      },
      {
        "key": "Б",
        "left": "Бизнес-менеджмент",
        "right": "Бизнес-концепция"
      },
      {
        "key": "В",
        "left": "Архитектор",
        "right": "Бизнес-логика"
      },
      {
        "key": "Г",
        "left": "Инженер",
        "right": "Физический уровень"
      },
      {
        "key": "Д",
        "left": "Технический специалист",
        "right": "Сборка"
      },
      {
        "key": "Е",
        "left": "Пользователь",
        "right": "Реализация"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T3Q9",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 9,
    "prompt": "Что определяется на уровне бизнес-контекста согласно модели Захмана?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Перечень составляющих бизнеса, определяющих содержание моделей идентификации"
      },
      {
        "key": "Б",
        "text": "Уточнение связей между бизнес-концепциями и отражение их в моделях определения"
      },
      {
        "key": "В",
        "text": "Реальные функционирующие объекты, с которыми работают сотрудники"
      },
      {
        "key": "Г",
        "text": "Логические системные модели, детализирующие системные требования"
      },
      {
        "key": "Д",
        "text": "Проектные решения без учета ограничений"
      }
    ],
    "explanation": "Правильный ответ: А) Перечень составляющих бизнеса, определяющих содержание моделей идентификации"
  },
  {
    "id": "T3Q10",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 10,
    "prompt": "Что определяется на уровне бизнес-концепции согласно модели Захмана?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Уточнение связей между бизнес-концепциями и отражение их в моделях определения"
      },
      {
        "key": "Б",
        "text": "Перечень составляющих бизнеса, определяющих содержание моделей идентификации"
      },
      {
        "key": "В",
        "text": "Реальные функционирующие объекты, с которыми работают сотрудники"
      },
      {
        "key": "Г",
        "text": "Проектные решения без учета ограничений"
      },
      {
        "key": "Д",
        "text": "Способ сборки и функционирования отдельных компонентов"
      }
    ],
    "explanation": "Правильный ответ: А) Уточнение связей между бизнес-концепциями и отражение их в моделях определения"
  },
  {
    "id": "T3Q11",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 11,
    "prompt": "Что определяется на уровне бизнес-логики согласно модели Захмана?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Логические системные модели, детализирующие системные требования"
      },
      {
        "key": "Б",
        "text": "Проектные решения без учета ограничений"
      },
      {
        "key": "В",
        "text": "Реальные функционирующие объекты, с которыми работают сотрудники"
      },
      {
        "key": "Г",
        "text": "Уточнение связей между бизнес-концепциями и отражение их в моделях определения"
      },
      {
        "key": "Д",
        "text": "Способ сборки и функционирования отдельных компонентов"
      }
    ],
    "explanation": "Правильный ответ: А) Логические системные модели, детализирующие системные требования"
  },
  {
    "id": "T3Q12",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 12,
    "prompt": "Что определяется на физическом уровне согласно модели Захмана?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Модели, оптимизирующие проектные решения с целью их реализации"
      },
      {
        "key": "Б",
        "text": "Реальные функционирующие объекты, с которыми работают сотрудники"
      },
      {
        "key": "В",
        "text": "Проектные решения без учета ограничений"
      },
      {
        "key": "Г",
        "text": "Способ сборки и функционирования отдельных компонентов"
      },
      {
        "key": "Д",
        "text": "Логические системные модели, детализирующие системные требования"
      }
    ],
    "explanation": "Правильный ответ: А) Модели, оптимизирующие проектные решения с целью их реализации"
  },
  {
    "id": "T3Q13",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 13,
    "prompt": "Что определяется на уровне сборки согласно модели Захмана?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Способ сборки и функционирования отдельных компонентов"
      },
      {
        "key": "Б",
        "text": "Модели, оптимизирующие проектные решения с целью их реализации"
      },
      {
        "key": "В",
        "text": "Проектные решения без учета ограничений"
      },
      {
        "key": "Г",
        "text": "Логические системные модели, детализирующие системные требования"
      },
      {
        "key": "Д",
        "text": "Перечень составляющих бизнеса, определяющих содержание моделей идентификации"
      }
    ],
    "explanation": "Правильный ответ: А) Способ сборки и функционирования отдельных компонентов"
  },
  {
    "id": "T3Q14",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 14,
    "prompt": "Что определяется на уровне реализации согласно модели Захмана?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Реальные функционирующие объекты, с которыми работают сотрудники"
      },
      {
        "key": "Б",
        "text": "Модели, оптимизирующие проектные решения с целью их реализации"
      },
      {
        "key": "В",
        "text": "Проектные решения без учета ограничений"
      },
      {
        "key": "Г",
        "text": "Способ сборки и функционирования отдельных компонентов"
      },
      {
        "key": "Д",
        "text": "Уточнение связей между бизнес-концепциями и отражение их в моделях определения"
      }
    ],
    "explanation": "Правильный ответ: А) Реальные функционирующие объекты, с которыми работают сотрудники"
  },
  {
    "id": "T3Q15",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 15,
    "prompt": "Что включается в корпоративную модель данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Концептуальная модель данных"
      },
      {
        "key": "Б",
        "text": "Описание потоков данных"
      },
      {
        "key": "В",
        "text": "Корпоративная архитектура"
      },
      {
        "key": "Г",
        "text": "Проект реализации программного продукта"
      },
      {
        "key": "Д",
        "text": "Модель Захмана"
      }
    ],
    "explanation": "Правильный ответ: А) Концептуальная модель данных; Б) Описание потоков данных"
  },
  {
    "id": "T3Q16",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 16,
    "prompt": "Разместите описания в соответствие видам моделей?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Концептуальная модель",
        "right": "Совокупность предметных областей со связями между ними"
      },
      {
        "key": "Б",
        "left": "Модель предметной области",
        "right": "Совокупность важных сущностей предметной области со связями"
      },
      {
        "key": "В",
        "left": "Логическая модель",
        "right": "Детализация сущностей до уровня атрибутов и описания связей между сущностями"
      },
      {
        "key": "Г",
        "left": "LDM",
        "right": "Описание сущностей и связей на уровне отдельных подобластей"
      },
      {
        "key": "Д",
        "left": "PDM",
        "right": "Описание физических объектов данных на уровне отдельной подобласти и связей между ними"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T3Q17",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 17,
    "prompt": "Какие основные элементы отражаются в описании потоков данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Основные сущности предметной области"
      },
      {
        "key": "Б",
        "text": "Бизнес-процессы"
      },
      {
        "key": "В",
        "text": "Бизнес-роли"
      },
      {
        "key": "Г",
        "text": "Конкретные пользователи"
      },
      {
        "key": "Д",
        "text": "Язык программирования"
      }
    ],
    "explanation": "Правильный ответ: А) Основные сущности предметной области; Б) Бизнес-процессы; В) Бизнес-роли"
  },
  {
    "id": "T3Q18",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 18,
    "prompt": "Какие задачи включаются в руководство архитектурой данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Определение стандартов"
      },
      {
        "key": "Б",
        "text": "Управление архитектурными решениями"
      },
      {
        "key": "В",
        "text": "Надзор за проектами"
      },
      {
        "key": "Г",
        "text": "Реализация программных приложений по обработке данных"
      },
      {
        "key": "Д",
        "text": "Определение бизнес-процессов предприятия"
      }
    ],
    "explanation": "Правильный ответ: А) Определение стандартов; Б) Управление архитектурными решениями; В) Надзор за проектами"
  },
  {
    "id": "T3Q19",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 19,
    "prompt": "Что определяется в стандартах в рамках руководства архитектурой данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Правила, руководства и спецификации, устанавливающие порядок использования данных"
      },
      {
        "key": "Б",
        "text": "Артефакты, обеспечивающие соблюдение директив руководства"
      },
      {
        "key": "В",
        "text": "Приоритетность проектов в портфеле проектов организации"
      },
      {
        "key": "Г",
        "text": "Архитектурные решения, используемые для реализации проектов"
      },
      {
        "key": "Д",
        "text": "Корпоративная архитектура данных"
      }
    ],
    "explanation": "Правильный ответ: А) Правила, руководства и спецификации, устанавливающие порядок использования данных"
  },
  {
    "id": "T3Q20",
    "topic": 3,
    "topicTitle": "Архитектура данных",
    "number": 20,
    "prompt": "На что влияет управлении архитектурными решениями в рамках руководства архитектурой данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Определение приоритетности проектов в портфеле проектов организации"
      },
      {
        "key": "Б",
        "text": "Порядок использования данных"
      },
      {
        "key": "В",
        "text": "Соблюдение директив руководства"
      },
      {
        "key": "Г",
        "text": "Инструменты реализации проектов"
      },
      {
        "key": "Д",
        "text": "Соблюдение последовательности работ при реализации проектов"
      }
    ],
    "explanation": "Правильный ответ: А) Определение приоритетности проектов в портфеле проектов организации"
  },
  {
    "id": "T4Q1",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 1,
    "prompt": "Почему модели данных являются критически важным элементом в управлении данными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Определяют единую общую терминологию"
      },
      {
        "key": "Б",
        "text": "Служат основным средством коммуникации при реализации проектов"
      },
      {
        "key": "В",
        "text": "Являются отправной точкой при реализации приложений"
      },
      {
        "key": "Г",
        "text": "Фиксируют фактические данные по деятельности, реализуемой в предметной области"
      },
      {
        "key": "Д",
        "text": "Документируют способы получения данных из источника"
      }
    ],
    "explanation": "Правильный ответ: А) Определяют единую общую терминологию; Б) Служат основным средством коммуникации при реализации проектов; В) Являются отправной точкой при реализации приложений"
  },
  {
    "id": "T4Q2",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 2,
    "prompt": "Что понимается под формализацией в контексте построения модели данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Краткое и четкое определение структур данных и связей между ними"
      },
      {
        "key": "Б",
        "text": "Текстовое описание требований к способу получения данных из источника"
      },
      {
        "key": "В",
        "text": "Моделирование бизнес-процесса с определением категорий обрабатываемых данных"
      },
      {
        "key": "Г",
        "text": "Построение схемы алгоритмов обработки данных в приложении"
      },
      {
        "key": "Д",
        "text": "Текстовое описание требований к интерфейсам обработки данных в приложении"
      }
    ],
    "explanation": "Правильный ответ: А) Краткое и четкое определение структур данных и связей между ними"
  },
  {
    "id": "T4Q3",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 3,
    "prompt": "Что позволяет объяснить модель данных, определяется область применения?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Границы контекста данных"
      },
      {
        "key": "Б",
        "text": "Структуры данных"
      },
      {
        "key": "В",
        "text": "Используемые типы данных"
      },
      {
        "key": "Г",
        "text": "Способы обработки данных"
      },
      {
        "key": "Д",
        "text": "Форматы хранения данных"
      }
    ],
    "explanation": "Правильный ответ: А) Границы контекста данных"
  },
  {
    "id": "T4Q4",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 4,
    "prompt": "Какие виды данных отображаются в моделях данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Сведения о категориях"
      },
      {
        "key": "Б",
        "text": "Сведения о ресурсах"
      },
      {
        "key": "В",
        "text": "Сведения о бизнес-событиях"
      },
      {
        "key": "Г",
        "text": "Детальные сведения о транзакциях"
      },
      {
        "key": "Д",
        "text": "Сведения о способах обработки данных"
      }
    ],
    "explanation": "Правильный ответ: А) Сведения о категориях; Б) Сведения о ресурсах; В) Сведения о бизнес-событиях; Г) Детальные сведения о транзакциях"
  },
  {
    "id": "T4Q5",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 5,
    "prompt": "Что понимается под Сущность в контексте моделирования данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Предмет, о котором собираются сведения из предметной области"
      },
      {
        "key": "Б",
        "text": "Материальный объект предметной области, участвующий в бизнес-процессе"
      },
      {
        "key": "В",
        "text": "Обобщенное название сведений об используемом оборудовании"
      },
      {
        "key": "Г",
        "text": "Участник выполнения обработки данных"
      },
      {
        "key": "Д",
        "text": "Документ, формируемый в бизнес-деятельности"
      }
    ],
    "explanation": "Правильный ответ: А) Предмет, о котором собираются сведения из предметной области"
  },
  {
    "id": "T4Q6",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 6,
    "prompt": "Что понимается под мощностью (кардинальностью) связи?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Сколько экземпляров одной сущности может быть связано с одним экземпляром другой сущности"
      },
      {
        "key": "Б",
        "text": "Вес сущность при оценке качества данных"
      },
      {
        "key": "В",
        "text": "Количество обращений к сущности для получения всех экземпляров"
      },
      {
        "key": "Г",
        "text": "Количество одновременно подключаемых к сущности потребителей данных"
      },
      {
        "key": "Д",
        "text": "Количество единовременно выдаваемых экземпляров данных, при составлении документов"
      }
    ],
    "explanation": "Правильный ответ: А) Сколько экземпляров одной сущности может быть связано с одним экземпляром другой сущности"
  },
  {
    "id": "T4Q7",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 7,
    "prompt": "Для чего используется внешний ключ?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Представление связи между сущностями"
      },
      {
        "key": "Б",
        "text": "Указание ссылки на объект предметной области"
      },
      {
        "key": "В",
        "text": "Установление связи между документами и данными"
      },
      {
        "key": "Г",
        "text": "Отображение идентифицирующих кодов из внешних справочников"
      },
      {
        "key": "Д",
        "text": "Использование в качестве альтернативного ключа"
      }
    ],
    "explanation": "Правильный ответ: А) Представление связи между сущностями"
  },
  {
    "id": "T4Q8",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 8,
    "prompt": "Что понимается под Доменом в модели данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Набор, диапазон или множество значений"
      },
      {
        "key": "Б",
        "text": "Атрибут сущности, не являющийся ключом"
      },
      {
        "key": "В",
        "text": "Ключевой атрибут сущности"
      },
      {
        "key": "Г",
        "text": "Смысловое значение атрибута сущности"
      },
      {
        "key": "Д",
        "text": "Набор сущностей, объединенных по определенному правилу"
      }
    ],
    "explanation": "Правильный ответ: А) Набор, диапазон или множество значений"
  },
  {
    "id": "T4Q9",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 9,
    "prompt": "Сопоставьте вид схемы представления данных и задачи, для которых используются соответствующие представления?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Реляционная",
        "right": "Отражение бизнес-данных"
      },
      {
        "key": "Б",
        "left": "Многомерная",
        "right": "Анализ при работе с большими объемами данных"
      },
      {
        "key": "В",
        "left": "Хронологическая",
        "right": "Представление данных с привязкой к конкретному моменту времени"
      },
      {
        "key": "Г",
        "left": "Объектно-ориентированная",
        "right": "Обозначение возможных действий на данными класса"
      },
      {
        "key": "Д",
        "left": "Графовая",
        "right": "Хранение данных, структура которых может быть представлена узлами и связями между ними"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T4Q10",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 10,
    "prompt": "Поставить в соответствие вид модели и описание особенностей ее построения?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Концептуальная",
        "right": "Важные для бизнеса сущности в рассматриваемой функциональной области"
      },
      {
        "key": "Б",
        "left": "Логическая",
        "right": "Требования к данным в контексте их применения"
      },
      {
        "key": "В",
        "left": "Физическая",
        "right": "Техническое решение по использованию данных"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T4Q11",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 11,
    "prompt": "Что представляет собой представление?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Виртуальная таблица, используемая для просмотра данных из одной или нескольких таблиц"
      },
      {
        "key": "Б",
        "text": "Сохраненные результаты запросов с автоматическим обновлением значений"
      },
      {
        "key": "В",
        "text": "Бизнес-представление таблицы данных"
      },
      {
        "key": "Г",
        "text": "Алгоритм обработки данных, инициируемый действием пользователя"
      },
      {
        "key": "Д",
        "text": "Автоматически выполняемая обработка данных"
      }
    ],
    "explanation": "Правильный ответ: А) Виртуальная таблица, используемая для просмотра данных из одной или нескольких таблиц"
  },
  {
    "id": "T4Q12",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 12,
    "prompt": "Что представляет собой материализованное представление?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Сохраненные результаты запросов с автоматическим обновлением значений"
      },
      {
        "key": "Б",
        "text": "Виртуальная таблица, используемая для просмотра данных из одной или нескольких таблиц"
      },
      {
        "key": "В",
        "text": "Таблицы, состоящая только из ключевых полей"
      },
      {
        "key": "Г",
        "text": "Многомерное представление данных со ссылками на таблицы-измерения"
      },
      {
        "key": "Д",
        "text": "Часть таблицы в соответствии с определенным доменом"
      }
    ],
    "explanation": "Правильный ответ: А) Сохраненные результаты запросов с автоматическим обновлением значений"
  },
  {
    "id": "T4Q13",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 13,
    "prompt": "Поставьте в соответствие нормальную форму и ключевой фактор ее реализации?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Первая нормальная форма",
        "right": "Наличие зависимости неключевого атрибута с первичным ключом"
      },
      {
        "key": "Б",
        "left": "Вторая нормальная форма",
        "right": "Зависимость атрибутов только от полного ключа"
      },
      {
        "key": "В",
        "left": "Третья нормальная форма",
        "right": "Отсутствие зависимости от неключевых атрибутов"
      },
      {
        "key": "Г",
        "left": "Нормальная форма Бойса- Кодда",
        "right": "Отсутствие функциональной зависимости в составных ключах"
      },
      {
        "key": "Д",
        "left": "Четвертая нормальная форма",
        "right": "Отсутствие многозначных зависимостей между атрибутами"
      },
      {
        "key": "Е",
        "left": "Пятая нормальная форма",
        "right": "Реализация попарных зависимостей атрибутов от компонентов первичного ключа"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T4Q14",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 14,
    "prompt": "Что представляет собой процесс прямого проектирования при построении модели данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Построение модели данных, отталкиваясь от требований к данным"
      },
      {
        "key": "Б",
        "text": "Построение модели данных, основываясь на существующей базе данных"
      },
      {
        "key": "В",
        "text": "Последовательное определение: сущность, атрибут, связь"
      },
      {
        "key": "Г",
        "text": "Установление прямого соответствия сущности и предмета в предметной области"
      },
      {
        "key": "Д",
        "text": "Определение последовательности заполнения таблиц данными"
      }
    ],
    "explanation": "Правильный ответ: А) Построение модели данных, отталкиваясь от требований к данным"
  },
  {
    "id": "T4Q15",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 15,
    "prompt": "Какие ключевые принципы используются при построении баз данных (PRISM)?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Производительность и простота использования"
      },
      {
        "key": "Б",
        "text": "Возможность повторного использования"
      },
      {
        "key": "В",
        "text": "Целостность"
      },
      {
        "key": "Г",
        "text": "Удобство сопровождения"
      },
      {
        "key": "Д",
        "text": "Структурированность"
      }
    ],
    "explanation": "Правильный ответ: А) Производительность и простота использования; Б) Возможность повторного использования; В) Целостность; Г) Удобство сопровождения"
  },
  {
    "id": "T4Q16",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 16,
    "prompt": "Какие метрики используются при оценке качества модели данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Как хорошо сформулированы определения"
      },
      {
        "key": "Б",
        "text": "Соблюдаются ли в модели стандарты именования"
      },
      {
        "key": "В",
        "text": "Насколько полно модель отражает предметную область"
      },
      {
        "key": "Г",
        "text": "Как много типов данных используется в модели"
      },
      {
        "key": "Д",
        "text": "Насколько детально представлен атрибутный состав сущностей"
      }
    ],
    "explanation": "Правильный ответ: А) Как хорошо сформулированы определения; Б) Соблюдаются ли в модели стандарты именования; В) Насколько полно модель отражает предметную область; Д) Насколько детально представлен атрибутный состав сущностей"
  },
  {
    "id": "T4Q17",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 17,
    "prompt": "Что включается в стандарт моделирования данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Соглашение именования элементов в модели"
      },
      {
        "key": "Б",
        "text": "Перечень и описание методов создания и сопровождения моделей данных"
      },
      {
        "key": "В",
        "text": "Руководство по использованию инструментов моделирования"
      },
      {
        "key": "Г",
        "text": "Описание допустимых типов данных в модели данных"
      },
      {
        "key": "Д",
        "text": "Перечень будущих пользователей данных"
      }
    ],
    "explanation": "Правильный ответ: А) Соглашение именования элементов в модели; Б) Перечень и описание методов создания и сопровождения моделей данных; В) Руководство по использованию инструментов моделирования; Г) Описание допустимых типов данных в модели данных"
  },
  {
    "id": "T4Q18",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 18,
    "prompt": "Чем обеспечивается целостность данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Ограничения для значений данных"
      },
      {
        "key": "Б",
        "text": "Корректность связей между ключами"
      },
      {
        "key": "В",
        "text": "Ограничение доступа к данным"
      },
      {
        "key": "Г",
        "text": "Отсутствие дублирования данных в разных таблицах"
      },
      {
        "key": "Д",
        "text": "Связь базы данных только с одним приложением"
      }
    ],
    "explanation": "Правильный ответ: А) Ограничения для значений данных; Б) Корректность связей между ключами"
  },
  {
    "id": "T4Q19",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 19,
    "prompt": "Каким правилам нужно следовать при именовании объектов в логической модели данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Осмысленность с точки зрения бизнес-пользователя"
      },
      {
        "key": "Б",
        "text": "Избегание сокращений, кроме общепринятых"
      },
      {
        "key": "В",
        "text": "Использование содержательные слова"
      },
      {
        "key": "Г",
        "text": "Недопустимость превышения длины наименования"
      },
      {
        "key": "Д",
        "text": "Использование только допустимых символов"
      }
    ],
    "explanation": "Правильный ответ: А) Осмысленность с точки зрения бизнес-пользователя; Б) Избегание сокращений, кроме общепринятых; В) Использование содержательные слова; Г) Недопустимость превышения длины наименования; Д) Использование только допустимых символов"
  },
  {
    "id": "T4Q20",
    "topic": 4,
    "topicTitle": "Моделирование и проектирование данных",
    "number": 20,
    "prompt": "Каким правилам нужно следовать при построении физической модели данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Не превышать допустимую длину наименования"
      },
      {
        "key": "Б",
        "text": "Использовать сокращения для сокращения длины наименования"
      },
      {
        "key": "В",
        "text": "Указывать тип данных в наименовании"
      },
      {
        "key": "Г",
        "text": "Отражать название выбранной СУБД"
      },
      {
        "key": "Д",
        "text": "Указывать нумерацию каждого именуемого элемента"
      }
    ],
    "explanation": "Правильный ответ: А) Не превышать допустимую длину наименования; Б) Использовать сокращения для сокращения длины наименования"
  },
  {
    "id": "T5Q1",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 1,
    "prompt": "Что относится к категории бизнес-метаданных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Правила преобразований, расчетные и логические формулы"
      },
      {
        "key": "Б",
        "text": "Правила измерения показателей качества данных"
      },
      {
        "key": "В",
        "text": "Классы конфиденциальности данных"
      },
      {
        "key": "Г",
        "text": "Права доступа"
      },
      {
        "key": "Д",
        "text": "Правила резервного копирования"
      }
    ],
    "explanation": "Правильный ответ: А) Правила преобразований, расчетные и логические формулы; Б) Правила измерения показателей качества данных; В) Классы конфиденциальности данных"
  },
  {
    "id": "T5Q2",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 2,
    "prompt": "Что относится к категории технических метаданных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Названия столбцов таблиц в физической модели данных"
      },
      {
        "key": "Б",
        "text": "Права доступа"
      },
      {
        "key": "В",
        "text": "Расписания заданий по загрузке/обновлению контента"
      },
      {
        "key": "Г",
        "text": "Известные проблемы с данными"
      },
      {
        "key": "Д",
        "text": "Журналы ошибок"
      }
    ],
    "explanation": "Правильный ответ: А) Названия столбцов таблиц в физической модели данных; Б) Права доступа; В) Расписания заданий по загрузке/обновлению контента"
  },
  {
    "id": "T5Q3",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 3,
    "prompt": "Что относится к категории операционных метаданных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Журналы ошибок"
      },
      {
        "key": "Б",
        "text": "Планы-графики выпуска новых версий"
      },
      {
        "key": "В",
        "text": "Правила архивирования данных"
      },
      {
        "key": "Г",
        "text": "Правила резервного копирования"
      },
      {
        "key": "Д",
        "text": "Ограничения по допустимым значениям"
      }
    ],
    "explanation": "Правильный ответ: А) Журналы ошибок; Б) Планы-графики выпуска новых версий; В) Правила архивирования данных; Г) Правила резервного копирования"
  },
  {
    "id": "T5Q4",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 4,
    "prompt": "Какие виды метаданных включаются в корпоративный репозиторий метаданных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Метаданные моделирования"
      },
      {
        "key": "Б",
        "text": "Метаданные ETL"
      },
      {
        "key": "В",
        "text": "Метаданные контроля качества"
      },
      {
        "key": "Г",
        "text": "Конфигурационные метаданные"
      },
      {
        "key": "Д",
        "text": "Метаданные пользователей"
      }
    ],
    "explanation": "Правильный ответ: А) Метаданные моделирования; Б) Метаданные ETL; В) Метаданные контроля качества; Г) Конфигурационные метаданные"
  },
  {
    "id": "T5Q5",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 5,
    "prompt": "Какие методы управления метаданными используются в организации?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Сбор и извлечение"
      },
      {
        "key": "Б",
        "text": "Каталогизация и индексирование"
      },
      {
        "key": "В",
        "text": "Управление качеством"
      },
      {
        "key": "Г",
        "text": "Защита и контроль доступа"
      },
      {
        "key": "Д",
        "text": "Моделирование"
      }
    ],
    "explanation": "Правильный ответ: А) Сбор и извлечение; Б) Каталогизация и индексирование; В) Управление качеством; Г) Защита и контроль доступа"
  },
  {
    "id": "T5Q6",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 6,
    "prompt": "Распределите задачи по методам управления метаданными?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Сбор и извлечение",
        "right": "Парсинг структуры данных"
      },
      {
        "key": "Б",
        "left": "Хранение и организация",
        "right": "Построение графов знаний и онтологии"
      },
      {
        "key": "В",
        "left": "Каталогизация и индексирование",
        "right": "Добавление семантических меток"
      },
      {
        "key": "Г",
        "left": "Управление качеством",
        "right": "Проверка на соответствие стандартам"
      },
      {
        "key": "Д",
        "left": "Интеграция и обмен",
        "right": "Объединение из разных источников"
      },
      {
        "key": "Е",
        "left": "Защита и контроль доступа",
        "right": "Логирование изменений"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T5Q7",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 7,
    "prompt": "Какие преимущества дает внедрение системы управления метаданными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Повышение прозрачности данных"
      },
      {
        "key": "Б",
        "text": "Снижение рисков"
      },
      {
        "key": "В",
        "text": "Ускорение интеграции данных"
      },
      {
        "key": "Г",
        "text": "Сохранность данных"
      },
      {
        "key": "Д",
        "text": "Защищенность от внешних угроз"
      }
    ],
    "explanation": "Правильный ответ: А) Повышение прозрачности данных; Б) Снижение рисков; В) Ускорение интеграции данных"
  },
  {
    "id": "T5Q8",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 8,
    "prompt": "Что такое «Каталог данных»?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Централизованная система для поиска, понимания и управления данными"
      },
      {
        "key": "Б",
        "text": "Справочник бизнес-данных, являющихся общими для всего предприятия"
      },
      {
        "key": "В",
        "text": "Система распределения доступа к бизнес-данным"
      },
      {
        "key": "Г",
        "text": "Система подготовки и выполнения правил контроля качества бизнес-данных"
      },
      {
        "key": "Д",
        "text": "Система построения моделей данных на концептуальном и внутреннем уровнях"
      }
    ],
    "explanation": "Правильный ответ: А) Централизованная система для поиска, понимания и управления данными"
  },
  {
    "id": "T5Q9",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 9,
    "prompt": "Что такое «Data Lineage»?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Процесс отслеживания пути данных от источника до конечного пункта назначения"
      },
      {
        "key": "Б",
        "text": "Модель данных концептуального уровня"
      },
      {
        "key": "В",
        "text": "Каталог правил контроля качества данных"
      },
      {
        "key": "Г",
        "text": "Система агрегирования данных для построения цепочки преобразования при решении бизнес-задач"
      },
      {
        "key": "Д",
        "text": "Модель потока данных при решении бизнес-задач"
      }
    ],
    "explanation": "Правильный ответ: А) Процесс отслеживания пути данных от источника до конечного пункта назначения"
  },
  {
    "id": "T5Q10",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 10,
    "prompt": "Для чего используется Data Lineage?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Обозначение связей наборов данных друг с другом"
      },
      {
        "key": "Б",
        "text": "Отображение процесса перемещения данных через системы, процессы и среды"
      },
      {
        "key": "В",
        "text": "Фиксация изменений данных в виде фильтрации, агрегации или очистки"
      },
      {
        "key": "Г",
        "text": "Помощь в выявлении и устранении ошибок в данных"
      },
      {
        "key": "Д",
        "text": "Фиксирование получения данных конкретным пользователем"
      }
    ],
    "explanation": "Правильный ответ: А) Обозначение связей наборов данных друг с другом; Б) Отображение процесса перемещения данных через системы, процессы и среды; В) Фиксация изменений данных в виде фильтрации, агрегации или очистки; Г) Помощь в выявлении и устранении ошибок в данных"
  },
  {
    "id": "T5Q11",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 11,
    "prompt": "Что включается в состав Глоссария данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Бизнес-термины, понятные потребителям данных"
      },
      {
        "key": "Б",
        "text": "Определения терминов"
      },
      {
        "key": "В",
        "text": "Бизнес-правила"
      },
      {
        "key": "Г",
        "text": "Ошибки качества данных"
      },
      {
        "key": "Д",
        "text": "Правила преобразования для бизнес-задач"
      }
    ],
    "explanation": "Правильный ответ: А) Бизнес-термины, понятные потребителям данных; Б) Определения терминов; В) Бизнес-правила"
  },
  {
    "id": "T5Q12",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 12,
    "prompt": "Какие задачи входят в процесс изменения и пополнения Глоссария данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Контроль дублей и избыточности"
      },
      {
        "key": "Б",
        "text": "Контроль контекста употребления терминов"
      },
      {
        "key": "В",
        "text": "Согласование основного варианта"
      },
      {
        "key": "Г",
        "text": "Информирование об изменениях"
      },
      {
        "key": "Д",
        "text": "Фиксирование правил качества данных"
      }
    ],
    "explanation": "Правильный ответ: А) Контроль дублей и избыточности; Б) Контроль контекста употребления терминов; В) Согласование основного варианта; Г) Информирование об изменениях"
  },
  {
    "id": "T5Q13",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 13,
    "prompt": "Какие методы используются при сборе и извлечении метаданных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Парсинг структур данных"
      },
      {
        "key": "Б",
        "text": "Добавление описаний, тегов, атрибутов"
      },
      {
        "key": "В",
        "text": "Извлечение в процессе интеграции данных"
      },
      {
        "key": "Г",
        "text": "Построение централизованного хранилища"
      },
      {
        "key": "Д",
        "text": "Добавление сематических меток"
      }
    ],
    "explanation": "Правильный ответ: А) Парсинг структур данных; В) Извлечение в процессе интеграции данных"
  },
  {
    "id": "T5Q14",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 14,
    "prompt": "Какие методы включаются в хранение и организацию метаданных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Построение централизованного хранилища метаданных"
      },
      {
        "key": "Б",
        "text": "Построение графов знаний и онтологий"
      },
      {
        "key": "В",
        "text": "Реализация хранения в облачных сервисах"
      },
      {
        "key": "Г",
        "text": "Добавление описаний, тегов и атрибутов"
      },
      {
        "key": "Д",
        "text": "Удаление дубликатов"
      }
    ],
    "explanation": "Правильный ответ: А) Построение централизованного хранилища метаданных; Б) Построение графов знаний и онтологий; В) Реализация хранения в облачных сервисах"
  },
  {
    "id": "T5Q15",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 15,
    "prompt": "Какие методы используются при каталогизации и индексировании метаданных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Реализация системы поиска и классификации данных"
      },
      {
        "key": "Б",
        "text": "Добавление семантических меток"
      },
      {
        "key": "В",
        "text": "Построение индексов по метаданным"
      },
      {
        "key": "Г",
        "text": "Построение графов знаний и онтологий"
      },
      {
        "key": "Д",
        "text": "Обеспечение контроля изменений"
      }
    ],
    "explanation": "Правильный ответ: А) Реализация системы поиска и классификации данных; Б) Добавление семантических меток; В) Построение индексов по метаданным"
  },
  {
    "id": "T5Q16",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 16,
    "prompt": "Какие методы используются при управлении качеством метаданных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Проверка на соответствие стандартам"
      },
      {
        "key": "Б",
        "text": "Удаление дубликатов и исправление ошибок"
      },
      {
        "key": "В",
        "text": "Обеспечение контроля изменений"
      },
      {
        "key": "Г",
        "text": "Добавление семантических меток"
      },
      {
        "key": "Д",
        "text": "Защита конфиденциальных метаданных"
      }
    ],
    "explanation": "Правильный ответ: А) Проверка на соответствие стандартам; Б) Удаление дубликатов и исправление ошибок; В) Обеспечение контроля изменений"
  },
  {
    "id": "T5Q17",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 17,
    "prompt": "Какие методы используются при интеграции и обмене метаданными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Реализации API на базе REST, GraphGL"
      },
      {
        "key": "Б",
        "text": "Применение стандартов JSON-LD, XML"
      },
      {
        "key": "В",
        "text": "Объединение из разных источников"
      },
      {
        "key": "Г",
        "text": "Хранение в облачных сервисах"
      },
      {
        "key": "Д",
        "text": "Извлечение в процессе интеграции данных"
      }
    ],
    "explanation": "Правильный ответ: А) Реализации API на базе REST, GraphGL; Б) Применение стандартов JSON-LD, XML; В) Объединение из разных источников; Д) Извлечение в процессе интеграции данных"
  },
  {
    "id": "T5Q18",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 18,
    "prompt": "Какие методы используются при реализации защиты и контроля доступа к метаданным?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Разграничение прав"
      },
      {
        "key": "Б",
        "text": "Защита конфиденциальных метаданных"
      },
      {
        "key": "В",
        "text": "Логирование изменений"
      },
      {
        "key": "Г",
        "text": "Удаление устаревших метаданных"
      },
      {
        "key": "Д",
        "text": "Блокирование доступа к метаданным из других АС"
      }
    ],
    "explanation": "Правильный ответ: А) Разграничение прав; Б) Защита конфиденциальных метаданных; В) Логирование изменений"
  },
  {
    "id": "T5Q19",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 19,
    "prompt": "Какие методы используются при автоматизации работы с метаданными?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Применение ML для категоризации данных"
      },
      {
        "key": "Б",
        "text": "Поиск аномалий"
      },
      {
        "key": "В",
        "text": "Создание описаний на основе контента"
      },
      {
        "key": "Г",
        "text": "Выполнение тегирования и аннотирования"
      },
      {
        "key": "Д",
        "text": "Объединение метаданных из разных источников"
      }
    ],
    "explanation": "Правильный ответ: А) Применение ML для категоризации данных; Б) Поиск аномалий; В) Создание описаний на основе контента; Г) Выполнение тегирования и аннотирования"
  },
  {
    "id": "T5Q20",
    "topic": 5,
    "topicTitle": "Управление метаданными",
    "number": 20,
    "prompt": "На какие виды разделяются метаданных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Бизнес-метаданные"
      },
      {
        "key": "Б",
        "text": "Технические"
      },
      {
        "key": "В",
        "text": "Операционные"
      },
      {
        "key": "Г",
        "text": "Пользовательские"
      },
      {
        "key": "Д",
        "text": "Регуляторные"
      }
    ],
    "explanation": "Правильный ответ: А) Бизнес-метаданные; Б) Технические; В) Операционные"
  },
  {
    "id": "T6Q1",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 1,
    "prompt": "Что понимается под Качеством данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Характеристика, показывающая степень пригодности данных к использованию"
      },
      {
        "key": "Б",
        "text": "Показатель соответствия данных в информационных системах реальным сведениям в предметной области"
      },
      {
        "key": "В",
        "text": "Показатель достаточности данных для выполнения бизнес-функций"
      },
      {
        "key": "Г",
        "text": "Характеристика, определяющая правила обеспечения целостности данных"
      },
      {
        "key": "Д",
        "text": "Показатель возможности хранения данных в хранилище данных"
      }
    ],
    "explanation": "Правильный ответ: А) Характеристика, показывающая степень пригодности данных к использованию"
  },
  {
    "id": "T6Q2",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 2,
    "prompt": "Что из перечисленного относится к характеристикам качества данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Полнота"
      },
      {
        "key": "Б",
        "text": "Точность и достоверность"
      },
      {
        "key": "В",
        "text": "Актуальность"
      },
      {
        "key": "Г",
        "text": "Сохраняемость"
      },
      {
        "key": "Д",
        "text": "Историчность"
      }
    ],
    "explanation": "Правильный ответ: А) Полнота; Б) Точность и достоверность; В) Актуальность"
  },
  {
    "id": "T6Q3",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 3,
    "prompt": "Поставьте в соответствие характеристику (колонка 1) и ее описание (колонка 2)?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Полнота",
        "right": "Достаточность объема, глубины и широты данных"
      },
      {
        "key": "Б",
        "left": "Актуальность",
        "right": "Соблюдение сроков и графиков создания, обновления или синхронизации данных"
      },
      {
        "key": "В",
        "left": "Согласованность",
        "right": "Непротиворечивость различных показателей и атрибутов"
      },
      {
        "key": "Г",
        "left": "Точность и достоверность",
        "right": "Степень соответствия между значениями атрибутов и истинным значением параметра объекта"
      },
      {
        "key": "Д",
        "left": "Уникальность",
        "right": "Отсутствие клонов"
      },
      {
        "key": "Е",
        "left": "Разумность",
        "right": "Соответствие фактических значений ожидаемым"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T6Q4",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 4,
    "prompt": "Поставьте в соответствие элемента характеристики «Полнота» его описанию?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Объем данных",
        "right": "Наличие всех необходимых объектов"
      },
      {
        "key": "Б",
        "left": "Широта данных",
        "right": "Наличие всех требуемых атрибутов объекта"
      },
      {
        "key": "В",
        "left": "Глубина данных",
        "right": "Наличие истории изменения объектов и их атрибутов за необходимый интервал времени"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T6Q5",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 5,
    "prompt": "Что определяет нормативные сроки для определения актуальности данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Действующее законодательство"
      },
      {
        "key": "Б",
        "text": "Требования регуляторов"
      },
      {
        "key": "В",
        "text": "Решения коллегиальных и единоличных органов управления организации"
      },
      {
        "key": "Г",
        "text": "Государственные стандарты"
      },
      {
        "key": "Д",
        "text": "Потребностями пользователей данных"
      }
    ],
    "explanation": "Правильный ответ: А) Действующее законодательство; Б) Требования регуляторов; В) Решения коллегиальных и единоличных органов управления организации; Г) Государственные стандарты"
  },
  {
    "id": "T6Q6",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 6,
    "prompt": "На основании каких правил определяется согласованность данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "Б",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Соответствии фактического значения его смыслу"
      },
      {
        "key": "Б",
        "text": "Соответствие значений двух связанных атрибутов"
      },
      {
        "key": "В",
        "text": "Наличие физической связи между атрибутами разных объектов"
      },
      {
        "key": "Г",
        "text": "Возможность выполнения вычислительной операции на основе данных разных атрибутов"
      },
      {
        "key": "Д",
        "text": "Соответствие формата представления одни данных в разных системах"
      }
    ],
    "explanation": "Правильный ответ: Б) Соответствие значений двух связанных атрибутов; Г) Возможность выполнения вычислительной операции на основе данных разных атрибутов; Д) Соответствие формата представления одни данных в разных системах"
  },
  {
    "id": "T6Q7",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 7,
    "prompt": "Что понимается под Целостностью данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Наличие для пары логически связанных объектов ссылочного ключа"
      },
      {
        "key": "Б",
        "text": "Соответствии фактического значения его смыслу"
      },
      {
        "key": "В",
        "text": "Соответствие значений двух связанных атрибутов"
      },
      {
        "key": "Г",
        "text": "Возможность выполнения вычислительной операции на основе данных разных атрибутов"
      },
      {
        "key": "Д",
        "text": "Соответствие формата представления одни данных в разных системах"
      }
    ],
    "explanation": "Правильный ответ: А) Наличие для пары логически связанных объектов ссылочного ключа"
  },
  {
    "id": "T6Q8",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 8,
    "prompt": "Что понимается под Достоверностью данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Соответствие данных сведениям из эталонного источника"
      },
      {
        "key": "Б",
        "text": "Соответствие значения атрибута его истинному значению"
      },
      {
        "key": "В",
        "text": "Соответствие формата представления одни данных в разных системах"
      },
      {
        "key": "Г",
        "text": "Наличие для пары логически связанных объектов ссылочного ключа"
      },
      {
        "key": "Д",
        "text": "Возможность выполнения вычислительной операции на основе данных разных атрибутов"
      }
    ],
    "explanation": "Правильный ответ: А) Соответствие данных сведениям из эталонного источника"
  },
  {
    "id": "T6Q9",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 9,
    "prompt": "Поставьте в соответствие функции Офиса CDO (колонка 2) задачам цикла управления качеством данных (колонка 1)?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Измерение качества данных",
        "right": "Профилирование данных"
      },
      {
        "key": "Б",
        "left": "Определение требований к результатам",
        "right": "Формирование требований к данным"
      },
      {
        "key": "В",
        "left": "Разработка мер по повышению качества данных",
        "right": "Разработка контролей"
      },
      {
        "key": "Г",
        "left": "Применение мер по повышению качества данных",
        "right": "Исправление накопленных ошибок"
      },
      {
        "key": "Д",
        "left": "Контроль и мониторинг результатов",
        "right": "Повторное профилирование данных"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T6Q10",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 10,
    "prompt": "Что понимается под Метрикой качества данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Значение, по которому можно судить о нарушении качества данных"
      },
      {
        "key": "Б",
        "text": "Мера оценки качества данных"
      },
      {
        "key": "В",
        "text": "Количество записей со значениями, не соответствующим ожидаемым"
      },
      {
        "key": "Г",
        "text": "Степень изменения значений по конкретному атрибуту"
      },
      {
        "key": "Д",
        "text": "Динамика изменения количества выявленных нарушений качества данных"
      }
    ],
    "explanation": "Правильный ответ: Б) Мера оценки качества данных"
  },
  {
    "id": "T6Q11",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 11,
    "prompt": "Что понимается под Индикатором качества данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Количественная оценка характеристики качества данных"
      },
      {
        "key": "Б",
        "text": "Значение, по которому можно судить о нарушении качества данных"
      },
      {
        "key": "В",
        "text": "Динамика изменения количества выявленных нарушений качества данных"
      },
      {
        "key": "Г",
        "text": "Величина отклонения фактического значения от медианного"
      },
      {
        "key": "Д",
        "text": "Количество исправленных инцидентов качества данных"
      }
    ],
    "explanation": "Правильный ответ: А) Количественная оценка характеристики качества данных"
  },
  {
    "id": "T6Q12",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 12,
    "prompt": "Что понимается под Профилированием данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Исследование данных на предмет выявления различных статистических параметров"
      },
      {
        "key": "Б",
        "text": "Выявление фактов нарушения качества данных"
      },
      {
        "key": "В",
        "text": "Создание логической модели данных"
      },
      {
        "key": "Г",
        "text": "Изучение предметной области для выявления ожидаемых значений по атрибутам"
      },
      {
        "key": "Д",
        "text": "Формирование предельно-допустимых значений для индикаторов качества данных"
      }
    ],
    "explanation": "Правильный ответ: А) Исследование данных на предмет выявления различных статистических параметров"
  },
  {
    "id": "T6Q13",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 13,
    "prompt": "Для чего используется профилирование данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Оценка пригодности данных для выполнения задач"
      },
      {
        "key": "Б",
        "text": "Выявление значимых рисков качества данных"
      },
      {
        "key": "В",
        "text": "Оценки результатов принятия мер по повышению качества данных"
      },
      {
        "key": "Г",
        "text": "Вычисление медианных значений индикаторов качества данных"
      },
      {
        "key": "Д",
        "text": "Построения модели данных"
      }
    ],
    "explanation": "Правильный ответ: А) Оценка пригодности данных для выполнения задач; Б) Выявление значимых рисков качества данных; В) Оценки результатов принятия мер по повышению качества данных"
  },
  {
    "id": "T6Q14",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 14,
    "prompt": "Для каких целей применяется Аудит данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "Б",
      "В",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Устранение проблем качества данных"
      },
      {
        "key": "Б",
        "text": "Формирование комплекса мер по повышению качества данных"
      },
      {
        "key": "В",
        "text": "Разработка алгоритмов повышения качества данных"
      },
      {
        "key": "Г",
        "text": "Формирование индикаторов качества данных"
      },
      {
        "key": "Д",
        "text": "Профилирование данных"
      }
    ],
    "explanation": "Правильный ответ: Б) Формирование комплекса мер по повышению качества данных; В) Разработка алгоритмов повышения качества данных; Д) Профилирование данных"
  },
  {
    "id": "T6Q15",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 15,
    "prompt": "Что выявляется в процессе аудита данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Бизнес-правила качества данных"
      },
      {
        "key": "Б",
        "text": "Существенные риски качества данных"
      },
      {
        "key": "В",
        "text": "Причины возникновения нарушения качества данных"
      },
      {
        "key": "Г",
        "text": "Реальные потребители данных"
      },
      {
        "key": "Д",
        "text": "Используемые в бизнес-задачах данные"
      }
    ],
    "explanation": "Правильный ответ: А) Бизнес-правила качества данных; Б) Существенные риски качества данных; В) Причины возникновения нарушения качества данных; Г) Реальные потребители данных; Д) Используемые в бизнес-задачах данные"
  },
  {
    "id": "T6Q16",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 16,
    "prompt": "Какие проверки включаются в форматно-логические контроли?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Типы данных и длины полей"
      },
      {
        "key": "Б",
        "text": "Заполненность полей"
      },
      {
        "key": "В",
        "text": "Контрольные суммы"
      },
      {
        "key": "Г",
        "text": "Соответствие НСИ"
      },
      {
        "key": "Д",
        "text": "Взаимозависимости"
      }
    ],
    "explanation": "Правильный ответ: А) Типы данных и длины полей; Б) Заполненность полей; В) Контрольные суммы; Г) Соответствие НСИ; Д) Взаимозависимости"
  },
  {
    "id": "T6Q17",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 17,
    "prompt": "Установите соответствие уровня плана мероприятий по повышению качества данных (колонка 1) и выполняемой задачи (колонка 2)?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Организационный уровень",
        "right": "Разработка правил обработки данных"
      },
      {
        "key": "Б",
        "left": "Аналитический уровень",
        "right": "Устранение системных проблем качества данных"
      },
      {
        "key": "В",
        "left": "Технический уровень",
        "right": "Разработка НСИ"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T6Q18",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 18,
    "prompt": "Что относится к методам предотвращения нарушения качества данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Реализация контролей при вводе данных"
      },
      {
        "key": "Б",
        "text": "Ликвидация точек сбоя"
      },
      {
        "key": "В",
        "text": "Ручная корректировка данных"
      },
      {
        "key": "Г",
        "text": "Доработки автоматизированных систем"
      },
      {
        "key": "Д",
        "text": "Алгоритмические корректировки данных"
      }
    ],
    "explanation": "Правильный ответ: А) Реализация контролей при вводе данных; Б) Ликвидация точек сбоя; Г) Доработки автоматизированных систем"
  },
  {
    "id": "T6Q19",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 19,
    "prompt": "На основании каких источников информации выполняется устранение нарушения качества данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Инциденты качества данных"
      },
      {
        "key": "Б",
        "text": "Жалобы пользователей"
      },
      {
        "key": "В",
        "text": "Результаты профилирования"
      },
      {
        "key": "Г",
        "text": "Изучение процессов"
      },
      {
        "key": "Д",
        "text": "Аналитика данных"
      }
    ],
    "explanation": "Правильный ответ: А) Инциденты качества данных; Б) Жалобы пользователей; В) Результаты профилирования; Г) Изучение процессов; Д) Аналитика данных"
  },
  {
    "id": "T6Q20",
    "topic": 6,
    "topicTitle": "Качество данных",
    "number": 20,
    "prompt": "Какие основные этапы включаются в проверки качества данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Контроль объема загрузки"
      },
      {
        "key": "Б",
        "text": "Проверка ссылочной целостности"
      },
      {
        "key": "В",
        "text": "Бизнес-проверки"
      },
      {
        "key": "Г",
        "text": "Проверка полноты модели данных"
      },
      {
        "key": "Д",
        "text": "Контроль доступных технических возможностей"
      }
    ],
    "explanation": "Правильный ответ: А) Контроль объема загрузки; Б) Проверка ссылочной целостности; В) Бизнес-проверки"
  },
  {
    "id": "T7Q1",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 1,
    "prompt": "На какие вопросы требуется найти ответы по результатам исследования при анализе данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Что нужно получить в качестве результата"
      },
      {
        "key": "Б",
        "text": "Как должен выглядеть результат"
      },
      {
        "key": "В",
        "text": "Какие данные нужно обработать для получения результата"
      },
      {
        "key": "Г",
        "text": "Какими инструментами нужно воспользоваться"
      },
      {
        "key": "Д",
        "text": "Кто должен выполнить анализ данных"
      }
    ],
    "explanation": "Правильный ответ: А) Что нужно получить в качестве результата; Б) Как должен выглядеть результат; В) Какие данные нужно обработать для получения результата; Г) Какими инструментами нужно воспользоваться"
  },
  {
    "id": "T7Q2",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 2,
    "prompt": "Какие действия нужно выполнить при сборе данных для выполнения анализа данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Определить состав необходимых данных"
      },
      {
        "key": "Б",
        "text": "Идентифицировать место хранения требуемых данных"
      },
      {
        "key": "В",
        "text": "Сформировать единое пространство необходимых данных"
      },
      {
        "key": "Г",
        "text": "Определить график поставки требуемых данных"
      },
      {
        "key": "Д",
        "text": "Трансформировать требуемые данных в необходимые форматы"
      }
    ],
    "explanation": "Правильный ответ: А) Определить состав необходимых данных; Б) Идентифицировать место хранения требуемых данных; В) Сформировать единое пространство необходимых данных; Г) Определить график поставки требуемых данных"
  },
  {
    "id": "T7Q3",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 3,
    "prompt": "Какие задачи выполняются при обработке первичных данных в рамках анализа данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Приведение одинаковых данных к единому формату"
      },
      {
        "key": "Б",
        "text": "Оценка качества собранных данных"
      },
      {
        "key": "В",
        "text": "Определение метода работы с некачественными данными"
      },
      {
        "key": "Г",
        "text": "Очистка данных от аномалий"
      },
      {
        "key": "Д",
        "text": "Агрегирование данных в едином пространстве"
      }
    ],
    "explanation": "Правильный ответ: А) Приведение одинаковых данных к единому формату; Б) Оценка качества собранных данных; В) Определение метода работы с некачественными данными; Г) Очистка данных от аномалий; Д) Агрегирование данных в едином пространстве"
  },
  {
    "id": "T7Q4",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 4,
    "prompt": "Какие задачи выполняются при анализе полученных результатов по итогам вычисление в рамках анализа данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Формулирование вывода"
      },
      {
        "key": "Б",
        "text": "Определение причин полученных результатов"
      },
      {
        "key": "В",
        "text": "Определение способа проверки полученных результатов"
      },
      {
        "key": "Г",
        "text": "Визуализация результатов"
      },
      {
        "key": "Д",
        "text": "Очистка результатов от выбросов"
      }
    ],
    "explanation": "Правильный ответ: А) Формулирование вывода; Б) Определение причин полученных результатов; В) Определение способа проверки полученных результатов; Г) Визуализация результатов"
  },
  {
    "id": "T7Q5",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 5,
    "prompt": "Указать последовательность шагов в процессе анализа данных?",
    "sourceType": "Установить правильный порядок ответов",
    "type": "order",
    "options": [
      {
        "key": "А",
        "text": "Постановка задачи"
      },
      {
        "key": "Б",
        "text": "Сбор данных"
      },
      {
        "key": "В",
        "text": "Обработка первичных данных"
      },
      {
        "key": "Г",
        "text": "Выполнение вычислений"
      },
      {
        "key": "Д",
        "text": "Анализ результатов"
      },
      {
        "key": "Е",
        "text": "Визуализация результатов"
      }
    ],
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д",
      "Е"
    ],
    "explanation": "Правильная последовательность: А → Б → В → Г → Д → Е. "
  },
  {
    "id": "T7Q6",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 6,
    "prompt": "Что представляет собой метод Описательной статистики при анализе данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Обработка данных, их систематизация и представление в виде таблиц, графиков и системы статистик"
      },
      {
        "key": "Б",
        "text": "Определение зависимости одного параметра от другого"
      },
      {
        "key": "В",
        "text": "Выделение различных групп объектов и их сегментирование"
      },
      {
        "key": "Г",
        "text": "Построение последовательности значений через равные промежутки времени для выявления трендов и закономерностей"
      },
      {
        "key": "Д",
        "text": "Агрегирование первичных данных и их углубленное исследование на предмет выявления закономерностей"
      }
    ],
    "explanation": "Правильный ответ: А) Обработка данных, их систематизация и представление в виде таблиц, графиков и системы статистик"
  },
  {
    "id": "T7Q7",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 7,
    "prompt": "Какие статистические показатели вычисляются в Описательной статистике при анализе данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Суммы"
      },
      {
        "key": "Б",
        "text": "Процентили"
      },
      {
        "key": "В",
        "text": "Вариации"
      },
      {
        "key": "Г",
        "text": "Среднее"
      },
      {
        "key": "Д",
        "text": "Корреляция"
      }
    ],
    "explanation": "Правильный ответ: А) Суммы; Б) Процентили; В) Вариации; Г) Среднее"
  },
  {
    "id": "T7Q8",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 8,
    "prompt": "В каком виде представляются результаты при использовании Описательной статистике в анализе данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Графики и диаграммы"
      },
      {
        "key": "Б",
        "text": "Таблицы"
      },
      {
        "key": "В",
        "text": "Статистические показатели"
      },
      {
        "key": "Г",
        "text": "Формулы вычислений"
      },
      {
        "key": "Д",
        "text": "Описательный отчет"
      }
    ],
    "explanation": "Правильный ответ: А) Графики и диаграммы; Б) Таблицы; В) Статистические показатели; Д) Описательный отчет"
  },
  {
    "id": "T7Q9",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 9,
    "prompt": "Какие есть достоинства Описательной статистики для анализа данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Можно увидеть явные закономерности"
      },
      {
        "key": "Б",
        "text": "Возможность использования различных инструментом, включая Excel и SQL"
      },
      {
        "key": "В",
        "text": "Позволяет сосредоточиться на бизнес-ценности анализа"
      },
      {
        "key": "Г",
        "text": "Выявляются причинно-следственные связи"
      },
      {
        "key": "Д",
        "text": "Позволяет сегментировать данные"
      }
    ],
    "explanation": "Правильный ответ: А) Можно увидеть явные закономерности; Б) Возможность использования различных инструментом, включая Excel и SQL; В) Позволяет сосредоточиться на бизнес-ценности анализа"
  },
  {
    "id": "T7Q10",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 10,
    "prompt": "Какую задачу решает Анализ корреляций при анализе данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Установление, как изменение одного параметра влияет на другой"
      },
      {
        "key": "Б",
        "text": "Систематизация первичных данных"
      },
      {
        "key": "В",
        "text": "Сегментирование групп данных"
      },
      {
        "key": "Г",
        "text": "Построение последовательности значений через равные промежутки времени"
      },
      {
        "key": "Д",
        "text": "Агрегирование первичных данных"
      }
    ],
    "explanation": "Правильный ответ: А) Установление, как изменение одного параметра влияет на другой"
  },
  {
    "id": "T7Q11",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 11,
    "prompt": "Какую «ловушку» имеет метод Анализа корреляций в анализе данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Данные могут быть коррелированы, но отсутствуют причинно-следственные связи между данными"
      },
      {
        "key": "Б",
        "text": "Данные могут быть сегментированы по группам, но отсутствует корреляция между ними"
      },
      {
        "key": "В",
        "text": "Отсутствие корреляции между данными, между которыми есть причинно-следственная связь"
      },
      {
        "key": "Г",
        "text": "Данные сегментированы, но отсутствует закономерности в значениях"
      },
      {
        "key": "Д",
        "text": "Выявляется тренд в значениях данных, но данные не коррелированы"
      }
    ],
    "explanation": "Правильный ответ: А) Данные могут быть коррелированы, но отсутствуют причинно-следственные связи между данными"
  },
  {
    "id": "T7Q12",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 12,
    "prompt": "Какую задачу решает Кластерный анализ при анализе данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Выделение различных групп данных"
      },
      {
        "key": "Б",
        "text": "Установление, как изменение одного параметра влияет на другой"
      },
      {
        "key": "В",
        "text": "Систематизация первичных данных"
      },
      {
        "key": "Г",
        "text": "Построение последовательности значений через равные промежутки времени"
      },
      {
        "key": "Д",
        "text": "Агрегирование первичных данных"
      }
    ],
    "explanation": "Правильный ответ: А) Выделение различных групп данных"
  },
  {
    "id": "T7Q13",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 13,
    "prompt": "Для чего используется метод Временных рядов при анализе данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Выстраивание последовательности значений на равных промежутках времени"
      },
      {
        "key": "Б",
        "text": "Построение динами изменения показателя на определенном интервале времени"
      },
      {
        "key": "В",
        "text": "Установление, как изменение одного параметра влияет на другой"
      },
      {
        "key": "Г",
        "text": "Выделение временных периодов одинакового изменения значений данных"
      },
      {
        "key": "Д",
        "text": "Агрегирование первичных данных"
      }
    ],
    "explanation": "Правильный ответ: А) Выстраивание последовательности значений на равных промежутках времени"
  },
  {
    "id": "T7Q14",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 14,
    "prompt": "Что включает в себя метод Анализа временных рядов при анализе данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Выявление трендов"
      },
      {
        "key": "Б",
        "text": "Выявление закономерностей"
      },
      {
        "key": "В",
        "text": "Построение прогнозов"
      },
      {
        "key": "Г",
        "text": "Расчет статистических показателей"
      },
      {
        "key": "Д",
        "text": "Очистка результатов от выбросов"
      }
    ],
    "explanation": "Правильный ответ: А) Выявление трендов; Б) Выявление закономерностей; В) Построение прогнозов"
  },
  {
    "id": "T7Q15",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 15,
    "prompt": "Что может показывать Временной ряд при анализе данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Тренд"
      },
      {
        "key": "Б",
        "text": "Сезонность"
      },
      {
        "key": "В",
        "text": "Цикличность"
      },
      {
        "key": "Г",
        "text": "Случайные колебания"
      },
      {
        "key": "Д",
        "text": "Сегменты данных"
      }
    ],
    "explanation": "Правильный ответ: А) Тренд; Б) Сезонность; В) Цикличность; Г) Случайные колебания"
  },
  {
    "id": "T7Q16",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 16,
    "prompt": "Что понимается под Сезонностью в методе Временных рядов при анализе данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Повторяющиеся изменения"
      },
      {
        "key": "Б",
        "text": "Долгосрочная тенденция"
      },
      {
        "key": "В",
        "text": "Повторяющиеся долгосрочные колебания"
      },
      {
        "key": "Г",
        "text": "Ситуативные факторы"
      },
      {
        "key": "Д",
        "text": "Ряд во времени"
      }
    ],
    "explanation": "Правильный ответ: А) Повторяющиеся изменения"
  },
  {
    "id": "T7Q17",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 17,
    "prompt": "Что понимается под Трендом в методе Временных рядов при анализе данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "В"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Повторяющиеся долгосрочные колебания"
      },
      {
        "key": "Б",
        "text": "Повторяющиеся изменения"
      },
      {
        "key": "В",
        "text": "Долгосрочная тенденция"
      },
      {
        "key": "Г",
        "text": "Ситуативные факторы"
      },
      {
        "key": "Д",
        "text": "Ряд на равных промежутках времени"
      }
    ],
    "explanation": "Правильный ответ: В) Долгосрочная тенденция"
  },
  {
    "id": "T7Q18",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 18,
    "prompt": "Что понимается под Цикличностью в методе Временных рядов при анализе данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "В"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Долгосрочная тенденция"
      },
      {
        "key": "Б",
        "text": "Повторяющиеся изменения"
      },
      {
        "key": "В",
        "text": "Повторяющиеся долгосрочные колебания"
      },
      {
        "key": "Г",
        "text": "Ситуативные факторы"
      },
      {
        "key": "Д",
        "text": "Ряд на равных промежутках времени"
      }
    ],
    "explanation": "Правильный ответ: В) Повторяющиеся долгосрочные колебания"
  },
  {
    "id": "T7Q19",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 19,
    "prompt": "Какие инструменты используются при анализе данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "MS Excel"
      },
      {
        "key": "Б",
        "text": "SQL"
      },
      {
        "key": "В",
        "text": "Python"
      },
      {
        "key": "Г",
        "text": "PowerShell"
      },
      {
        "key": "Д",
        "text": "Draw.io"
      }
    ],
    "explanation": "Правильный ответ: А) MS Excel; Б) SQL; В) Python"
  },
  {
    "id": "T7Q20",
    "topic": 7,
    "topicTitle": "Анализ данных",
    "number": 20,
    "prompt": "Какие функции и методы используются при анализе данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Сводные таблицы"
      },
      {
        "key": "Б",
        "text": "Статистические"
      },
      {
        "key": "В",
        "text": "Анализ временных рядов"
      },
      {
        "key": "Г",
        "text": "Ввода/вывода данных"
      },
      {
        "key": "Д",
        "text": "Лингвистического анализа"
      }
    ],
    "explanation": "Правильный ответ: А) Сводные таблицы; Б) Статистические; В) Анализ временных рядов"
  },
  {
    "id": "T8Q1",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 1,
    "prompt": "Какими ключевыми характеристиками обладает НСИ (нормативно-справочная информация)?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Статичность"
      },
      {
        "key": "Б",
        "text": "Регламентированность"
      },
      {
        "key": "В",
        "text": "Многократное использование"
      },
      {
        "key": "Г",
        "text": "Временность"
      },
      {
        "key": "Д",
        "text": "Историчность"
      }
    ],
    "explanation": "Правильный ответ: А) Статичность; Б) Регламентированность; В) Многократное использование"
  },
  {
    "id": "T8Q2",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 2,
    "prompt": "Какими характеристиками обладает Справочник?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Унификация"
      },
      {
        "key": "Б",
        "text": "Идентификация"
      },
      {
        "key": "В",
        "text": "Использование в документах"
      },
      {
        "key": "Г",
        "text": "Согласованность"
      },
      {
        "key": "Д",
        "text": "Целостность"
      }
    ],
    "explanation": "Правильный ответ: А) Унификация; Б) Идентификация; В) Использование в документах; Г) Согласованность; Д) Целостность"
  },
  {
    "id": "T8Q3",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 3,
    "prompt": "Что понимается под Классификатором?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Справочник, который используется для систематизации и группировки объектов по определенным признакам"
      },
      {
        "key": "Б",
        "text": "Набор характеристик, по которым идентифицируется объект предметной области"
      },
      {
        "key": "В",
        "text": "Совокупность идентифицирующих данных, по которым разделяются группы данных"
      },
      {
        "key": "Г",
        "text": "Особый вид НСИ, используемый для ввода данных в интерфейсе пользовательского приложения"
      },
      {
        "key": "Д",
        "text": "Свод правил и стандартов по наполнению НСИ"
      }
    ],
    "explanation": "Правильный ответ: А) Справочник, который используется для систематизации и группировки объектов по определенным признакам"
  },
  {
    "id": "T8Q4",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 4,
    "prompt": "Какими характеристиками обладает Классификатор?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Систематизация"
      },
      {
        "key": "Б",
        "text": "Кодирование"
      },
      {
        "key": "В",
        "text": "Иерархичность"
      },
      {
        "key": "Г",
        "text": "Стандартизация"
      },
      {
        "key": "Д",
        "text": "Уникальность"
      }
    ],
    "explanation": "Правильный ответ: А) Систематизация; Б) Кодирование; В) Иерархичность; Г) Стандартизация"
  },
  {
    "id": "T8Q5",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 5,
    "prompt": "Для каких задач выполняют Справочники?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Обеспечение единообразия"
      },
      {
        "key": "Б",
        "text": "Повышение качества данных"
      },
      {
        "key": "В",
        "text": "Упрощение интеграции"
      },
      {
        "key": "Г",
        "text": "Облегчение анализа"
      },
      {
        "key": "Д",
        "text": "Групповая обработка"
      }
    ],
    "explanation": "Правильный ответ: А) Обеспечение единообразия; Б) Повышение качества данных; В) Упрощение интеграции; Г) Облегчение анализа"
  },
  {
    "id": "T8Q6",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 6,
    "prompt": "Каким образом Справочники повышают качество данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Предотвращение ошибок ввода"
      },
      {
        "key": "Б",
        "text": "Обеспечение удаления всех данных, соответствующих одному значению Справочника"
      },
      {
        "key": "В",
        "text": "Гарантированность использования одних и тех же терминов для одинаковых объектов"
      },
      {
        "key": "Г",
        "text": "Позволяют интегрировать данные из разных систем"
      },
      {
        "key": "Д",
        "text": "Обеспечивают формирование консолидированной отчетности"
      }
    ],
    "explanation": "Правильный ответ: А) Предотвращение ошибок ввода"
  },
  {
    "id": "T8Q7",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 7,
    "prompt": "В чем заключается задача упрощения интеграции при использовании Справочников?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Обеспечение обмена данными между системами"
      },
      {
        "key": "Б",
        "text": "Предотвращение появления дубликатов данных"
      },
      {
        "key": "В",
        "text": "Гарантированность использования одних и тех же терминов для одинаковых объектов"
      },
      {
        "key": "Г",
        "text": "Формирование консолидированной отчетности"
      },
      {
        "key": "Д",
        "text": "Точное совпадение справочников в разных системах"
      }
    ],
    "explanation": "Правильный ответ: А) Обеспечение обмена данными между системами"
  },
  {
    "id": "T8Q8",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 8,
    "prompt": "Что понимается под Master Data?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Единая и достоверная информация о ключевых объектах предметной области"
      },
      {
        "key": "Б",
        "text": "Сводный справочник, единый для всех систем организации"
      },
      {
        "key": "В",
        "text": "Совокупность внешних справочников, используемых для классификации бизнес-данных"
      },
      {
        "key": "Г",
        "text": "Совокупность данных из различных источников информации"
      },
      {
        "key": "Д",
        "text": "Сведения о структуре и использованию бизнес-данных"
      }
    ],
    "explanation": "Правильный ответ: А) Единая и достоверная информация о ключевых объектах предметной области"
  },
  {
    "id": "T8Q9",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 9,
    "prompt": "Какими характеристиками обладают мастер-данные?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Критичность для бизнеса"
      },
      {
        "key": "Б",
        "text": "Транзакционная зависимость"
      },
      {
        "key": "В",
        "text": "Комплексность"
      },
      {
        "key": "Г",
        "text": "Зависимость от справочников"
      },
      {
        "key": "Д",
        "text": "Регламентированность"
      }
    ],
    "explanation": "Правильный ответ: А) Критичность для бизнеса; В) Комплексность; Г) Зависимость от справочников; Д) Регламентированность"
  },
  {
    "id": "T8Q10",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 10,
    "prompt": "Какая основная цель использования MDM?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Реализация хранилища выверенных, уникальных и актуальных данных"
      },
      {
        "key": "Б",
        "text": "Формирование консолидированной отчетности в организации"
      },
      {
        "key": "В",
        "text": "Выявление нарушения качества данных в разных системах, использующих общие данные"
      },
      {
        "key": "Г",
        "text": "Обеспечение согласованности значений в таблицах базы данных"
      },
      {
        "key": "Д",
        "text": "Систематизации справочной информации"
      }
    ],
    "explanation": "Правильный ответ: А) Реализация хранилища выверенных, уникальных и актуальных данных"
  },
  {
    "id": "T8Q11",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 11,
    "prompt": "В какой последовательности выполняются операции в MDM-процессе по клиентам организации?",
    "sourceType": "Расположите в нужном порядке",
    "type": "order",
    "options": [
      {
        "key": "А",
        "text": "Интеграция систем с данными о клиентах"
      },
      {
        "key": "Б",
        "text": "Консолидация данных о клиенте"
      },
      {
        "key": "В",
        "text": "Обогащение данных о клиенте"
      },
      {
        "key": "Г",
        "text": "Формирование цифрового профиля клиента"
      },
      {
        "key": "Д",
        "text": "Создание «золотой записи» клиента"
      }
    ],
    "answer": [
      "А",
      "Б",
      "В",
      "Д",
      "Г"
    ],
    "explanation": "Правильная последовательность: А → Б → В → Д → Г. "
  },
  {
    "id": "T8Q12",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 12,
    "prompt": "Установите соответствие модели управления НСИ (колонка 1) и ее преимущества (колонка 2)?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Децентрализованная",
        "right": "Адаптация справочника под нужды подразделения"
      },
      {
        "key": "Б",
        "left": "Централизованная",
        "right": "Достоверность данных во всей организации"
      },
      {
        "key": "В",
        "left": "Гибридная",
        "right": "Баланс между скоростью обновления и стоимостью поддержания"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T8Q13",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 13,
    "prompt": "Какие задачи выполняются при Проектировании и определения методологии ведения НСИ?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Идентификация потребности"
      },
      {
        "key": "Б",
        "text": "Определение ролевой модели"
      },
      {
        "key": "В",
        "text": "Определение структуры данных"
      },
      {
        "key": "Г",
        "text": "Разработка правил и стандартов"
      },
      {
        "key": "Д",
        "text": "Обучение пользователей"
      }
    ],
    "explanation": "Правильный ответ: А) Идентификация потребности; Б) Определение ролевой модели; В) Определение структуры данных; Г) Разработка правил и стандартов"
  },
  {
    "id": "T8Q14",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 14,
    "prompt": "Какие задачи выполняются при Внедрении и начальном наполнение НСИ?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Миграция данных"
      },
      {
        "key": "Б",
        "text": "Интеграция"
      },
      {
        "key": "В",
        "text": "Обучение пользователей"
      },
      {
        "key": "Г",
        "text": "Разработка правил и стандартов"
      },
      {
        "key": "Д",
        "text": "Контроль соблюдения методологии"
      }
    ],
    "explanation": "Правильный ответ: А) Миграция данных; Б) Интеграция; В) Обучение пользователей"
  },
  {
    "id": "T8Q15",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 15,
    "prompt": "Что понимается под задачей «Интеграция» в жизненном цикле ведения НСИ?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Настройка технических связей между НСИ и системами-потребителями"
      },
      {
        "key": "Б",
        "text": "Сбор данных из разрозненных источников"
      },
      {
        "key": "В",
        "text": "Удаление дубликатов данных и загрузка в централизованную систему НСИ"
      },
      {
        "key": "Г",
        "text": "Архивирование неиспользуемых данных"
      },
      {
        "key": "Д",
        "text": "Описание правил передачи данных из систем-источников в систему НСИ"
      }
    ],
    "explanation": "Правильный ответ: А) Настройка технических связей между НСИ и системами-потребителями"
  },
  {
    "id": "T8Q16",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 16,
    "prompt": "Какие задачи выполняются при Эксплуатации и мониторинге качества НСИ?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Администрирование и поддержка"
      },
      {
        "key": "Б",
        "text": "Контроль соблюдения методологии"
      },
      {
        "key": "В",
        "text": "Мониторинг использования"
      },
      {
        "key": "Г",
        "text": "Внесение изменений в правила"
      },
      {
        "key": "Д",
        "text": "Миграция данных"
      }
    ],
    "explanation": "Правильный ответ: А) Администрирование и поддержка; Б) Контроль соблюдения методологии; В) Мониторинг использования"
  },
  {
    "id": "T8Q17",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 17,
    "prompt": "Какие задачи выполняются при Актуализации и развитии методологии ведения НСИ?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Сбор обратной связи"
      },
      {
        "key": "Б",
        "text": "Внесение изменений в объекты НСИ"
      },
      {
        "key": "В",
        "text": "Внесение изменений в правила"
      },
      {
        "key": "Г",
        "text": "Развитие системы"
      },
      {
        "key": "Д",
        "text": "Мониторинг использования"
      }
    ],
    "explanation": "Правильный ответ: А) Сбор обратной связи; Б) Внесение изменений в объекты НСИ; В) Внесение изменений в правила; Г) Развитие системы"
  },
  {
    "id": "T8Q18",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 18,
    "prompt": "Какие задачи выполняются при Выводе справочника из эксплуатации?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Остановка использования"
      },
      {
        "key": "Б",
        "text": "Архивирование данных"
      },
      {
        "key": "В",
        "text": "Отключение интеграций"
      },
      {
        "key": "Г",
        "text": "Сбор обратной связи"
      },
      {
        "key": "Д",
        "text": "Внесение изменений в правила"
      }
    ],
    "explanation": "Правильный ответ: А) Остановка использования; Б) Архивирование данных; В) Отключение интеграций"
  },
  {
    "id": "T8Q19",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 19,
    "prompt": "Какие компоненты справочника включаются в систему управления НСИ?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Перекодировочные таблицы"
      },
      {
        "key": "Б",
        "text": "Ответственные лица"
      },
      {
        "key": "В",
        "text": "Процессы согласования и утверждения"
      },
      {
        "key": "Г",
        "text": "Правила ведения справочника и связанные бизнес-правила"
      },
      {
        "key": "Д",
        "text": "Бизнес-данные, связанные со справочниками"
      }
    ],
    "explanation": "Правильный ответ: А) Перекодировочные таблицы; Б) Ответственные лица; В) Процессы согласования и утверждения; Г) Правила ведения справочника и связанные бизнес-правила"
  },
  {
    "id": "T8Q20",
    "topic": 8,
    "topicTitle": "RDM & MDM",
    "number": 20,
    "prompt": "Какие запросы от бизнес-подразделений формируются при сборе обратной связи при ведении НСИ?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Изменение структуры справочника"
      },
      {
        "key": "Б",
        "text": "Изменение правил ведения справочника"
      },
      {
        "key": "В",
        "text": "Внедрение нового функционала в систему НСИ"
      },
      {
        "key": "Г",
        "text": "Удаление данных из справочника"
      },
      {
        "key": "Д",
        "text": "Начальное наполнение справочника"
      }
    ],
    "explanation": "Правильный ответ: А) Изменение структуры справочника; Б) Изменение правил ведения справочника; В) Внедрение нового функционала в систему НСИ"
  },
  {
    "id": "T9Q1",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 1,
    "prompt": "Что понимается под термином «Информационная безопасность» (ИБ)?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "Б",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Управление рисками в охране труда"
      },
      {
        "key": "Б",
        "text": "Защита информации и связанных активов от угроз"
      },
      {
        "key": "В",
        "text": "Защита компьютеров от вирусов"
      },
      {
        "key": "Г",
        "text": "Просто хранение данных без защиты"
      },
      {
        "key": "Д",
        "text": "Обеспечение CIA и законности обработки"
      }
    ],
    "explanation": "Правильный ответ: Б) Защита информации и связанных активов от угроз; Д) Обеспечение CIA и законности обработки"
  },
  {
    "id": "T9Q2",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 2,
    "prompt": "Как расшифровывается аббревиатура CIA?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Г"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Central Intelligence Agency,"
      },
      {
        "key": "Б",
        "text": "Compliance, Integrity, Audit"
      },
      {
        "key": "В",
        "text": "Communications, Interface, Access"
      },
      {
        "key": "Г",
        "text": "Confidentiality, Integrity, Availability"
      },
      {
        "key": "Д",
        "text": "Common Interface Access"
      }
    ],
    "explanation": "Правильный ответ: Г) Confidentiality, Integrity, Availability"
  },
  {
    "id": "T9Q3",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 3,
    "prompt": "Как понимаются угрозы и риски в контексте ИБ?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Угроза — событие; риск — вероятность и последствия"
      },
      {
        "key": "Б",
        "text": "Угроза и риск — одно и то же"
      },
      {
        "key": "В",
        "text": "Угроза — только техническое нарушение;"
      },
      {
        "key": "Г",
        "text": "Угроза — правовая защита; риск — экономическая выгода"
      },
      {
        "key": "Д",
        "text": "Риск — только юридический аспект"
      }
    ],
    "explanation": "Правильный ответ: А) Угроза — событие; риск — вероятность и последствия"
  },
  {
    "id": "T9Q4",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 4,
    "prompt": "Что понимается под термином «Криптография»?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Способ хранения паролей без шифрования"
      },
      {
        "key": "Б",
        "text": "Набор методов защиты информации через шифрование"
      },
      {
        "key": "В",
        "text": "Вид программного обеспечения для ускорения сети"
      },
      {
        "key": "Г",
        "text": "Метод физической защиты серверов"
      },
      {
        "key": "Д",
        "text": "Язык программирования"
      }
    ],
    "explanation": "Правильный ответ: Б) Набор методов защиты информации через шифрование"
  },
  {
    "id": "T9Q5",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 5,
    "prompt": "В чем выражаются отличительные особенности симметричного и асимметричного шифрования?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "В"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Симметричное — более безопасное; асимметричное — менее безопасное"
      },
      {
        "key": "Б",
        "text": "Оба одинаковы по принципу и применению"
      },
      {
        "key": "В",
        "text": "Симметричное — один ключ; асимметричное — пара ключей"
      },
      {
        "key": "Г",
        "text": "Симметричное используется только для документов"
      },
      {
        "key": "Д",
        "text": "Асимметричное более быстрое"
      }
    ],
    "explanation": "Правильный ответ: В) Симметричное — один ключ; асимметричное — пара ключей"
  },
  {
    "id": "T9Q6",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 6,
    "prompt": "Что понимается под цифровой подписью?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Обеспечение целостности и подлинности"
      },
      {
        "key": "Б",
        "text": "Сертификат"
      },
      {
        "key": "В",
        "text": "Способ защиты паролей"
      },
      {
        "key": "Г",
        "text": "Метрика производительности сети"
      },
      {
        "key": "Д",
        "text": "Подтверждение авторства"
      }
    ],
    "explanation": "Правильный ответ: А) Обеспечение целостности и подлинности; Д) Подтверждение авторства"
  },
  {
    "id": "T9Q7",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 7,
    "prompt": "Что из перечисленного входит в политику информационной безопасности?",
    "sourceType": "Выберите правильные ответы",
    "answer": [
      "А",
      "Б",
      "В",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Требования к паролям"
      },
      {
        "key": "Б",
        "text": "Цели информационной безопасности"
      },
      {
        "key": "В",
        "text": "План реагирования на инциденты"
      },
      {
        "key": "Г",
        "text": "Регламенты по закупкам техники"
      },
      {
        "key": "Д",
        "text": "Правила аутентификации и авторизации"
      }
    ],
    "explanation": "Правильный ответ: А) Требования к паролям; Б) Цели информационной безопасности; В) План реагирования на инциденты; Д) Правила аутентификации и авторизации"
  },
  {
    "id": "T9Q8",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 8,
    "prompt": "Какие меры из перечисленного применяются для защиты базы данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Аутентификация и контроль доступа"
      },
      {
        "key": "Б",
        "text": "Шифрование в покое (TDE) и в передаче (TLS)"
      },
      {
        "key": "В",
        "text": "Обновление ПО"
      },
      {
        "key": "Г",
        "text": "Физическая охрана серверов"
      },
      {
        "key": "Д",
        "text": "Резервное копирование"
      }
    ],
    "explanation": "Правильный ответ: А) Аутентификация и контроль доступа; Б) Шифрование в покое (TDE) и в передаче (TLS); В) Обновление ПО; Г) Физическая охрана серверов; Д) Резервное копирование"
  },
  {
    "id": "T9Q9",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 9,
    "prompt": "В чём разница между аутентификацией и авторизацией?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Это одно и то же"
      },
      {
        "key": "Б",
        "text": "Аутентификация — подтверждение личности; авторизация — прав доступа"
      },
      {
        "key": "В",
        "text": "Аутентификация — защита сетевого трафика; авторизация — защита данных"
      },
      {
        "key": "Г",
        "text": "Аутентификация — хранение паролей; авторизация — их шифрование"
      },
      {
        "key": "Д",
        "text": "Аутентификация — подтверждение прав доступа; авторизация — защита авторских прав"
      }
    ],
    "explanation": "Правильный ответ: Б) Аутентификация — подтверждение личности; авторизация — прав доступа"
  },
  {
    "id": "T9Q10",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 10,
    "prompt": "Что из перечисленного входит в процесс управления рисками в ИБ?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Анализ рисков"
      },
      {
        "key": "Б",
        "text": "Разработка политик и процедур"
      },
      {
        "key": "В",
        "text": "Реагирование на инциденты"
      },
      {
        "key": "Г",
        "text": "Аудит и сертификация"
      },
      {
        "key": "Д",
        "text": "Оценка вероятности воздействия"
      }
    ],
    "explanation": "Правильный ответ: А) Анализ рисков; Б) Разработка политик и процедур; В) Реагирование на инциденты; Г) Аудит и сертификация; Д) Оценка вероятности воздействия"
  },
  {
    "id": "T9Q11",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 11,
    "prompt": "Как расшифровывается DPIA?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Digital Process Integrity Assessment"
      },
      {
        "key": "Б",
        "text": "Data Protection Impact Assessment"
      },
      {
        "key": "В",
        "text": "Data Processing Internal Allocation"
      },
      {
        "key": "Г",
        "text": "Device Protection and Isolation Analysis"
      },
      {
        "key": "Д",
        "text": "Data Productivity International Autority"
      }
    ],
    "explanation": "Правильный ответ: Б) Data Protection Impact Assessment"
  },
  {
    "id": "T9Q12",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 12,
    "prompt": "Что такое резервное копирование 3-2-1?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Три копии на двух носителях, одна вне основного места"
      },
      {
        "key": "Б",
        "text": "Один бэкап на два внешних диска, три раза в месяц"
      },
      {
        "key": "В",
        "text": "Резервное копирование трижды в месяц, в двух разных облаках"
      },
      {
        "key": "Г",
        "text": "Три инженера бэкапа, два администратора СУБД, один сервер"
      },
      {
        "key": "Д",
        "text": "Резервное копирование по принципу Фибоначчи"
      }
    ],
    "explanation": "Правильный ответ: А) Три копии на двух носителях, одна вне основного места"
  },
  {
    "id": "T9Q13",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 13,
    "prompt": "Что из перечисленного включается в процесс управления уязвимостями?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Планирование и применение патчей"
      },
      {
        "key": "Б",
        "text": "Идентификация уязвимостей"
      },
      {
        "key": "В",
        "text": "Мониторинг уязвимостей"
      },
      {
        "key": "Г",
        "text": "Автоматическое блокирование пользователей"
      },
      {
        "key": "Д",
        "text": "Оценка риска"
      }
    ],
    "explanation": "Правильный ответ: А) Планирование и применение патчей; Б) Идентификация уязвимостей; В) Мониторинг уязвимостей; Д) Оценка риска"
  },
  {
    "id": "T9Q14",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 14,
    "prompt": "Что из перечисленного относится к распространенным сетевым угрозам?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "DDoS"
      },
      {
        "key": "Б",
        "text": "Фишинг"
      },
      {
        "key": "В",
        "text": "Физические кражи устройств"
      },
      {
        "key": "Г",
        "text": "Ошибки пользователя"
      },
      {
        "key": "Д",
        "text": "MITM (человек посередине)"
      }
    ],
    "explanation": "Правильный ответ: А) DDoS; Б) Фишинг; Д) MITM (человек посередине)"
  },
  {
    "id": "T9Q15",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 15,
    "prompt": "Что понимается под термином Threat modeling?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Систематический анализ угроз на ранних стадиях проекта"
      },
      {
        "key": "Б",
        "text": "Аудит кода на угрозы, риски,"
      },
      {
        "key": "В",
        "text": "Тестирование производительности"
      },
      {
        "key": "Г",
        "text": "Игнорирование угроз на ранних стадиях"
      },
      {
        "key": "Д",
        "text": "Создание ролевых моделей"
      }
    ],
    "explanation": "Правильный ответ: А) Систематический анализ угроз на ранних стадиях проекта"
  },
  {
    "id": "T9Q16",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 16,
    "prompt": "Что из перечисленного относится к стандартам ИБ?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "ISO 27001"
      },
      {
        "key": "Б",
        "text": "PCI DSS"
      },
      {
        "key": "В",
        "text": "Это устаревшие требования"
      },
      {
        "key": "Г",
        "text": "NIST CSF"
      },
      {
        "key": "Д",
        "text": "152-ФЗ"
      }
    ],
    "explanation": "Правильный ответ: А) ISO 27001; Б) PCI DSS; Г) NIST CSF; Д) 152-ФЗ"
  },
  {
    "id": "T9Q17",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 17,
    "prompt": "Укажите причины важности физической безопасности для ИБ?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Защищает оборудование, документы и доступы к помещениям;"
      },
      {
        "key": "Б",
        "text": "Предотвращает кражи, повреждения и несанкционированный доступ"
      },
      {
        "key": "В",
        "text": "Только для охраны труда"
      },
      {
        "key": "Г",
        "text": "Не применима к ИБ"
      },
      {
        "key": "Д",
        "text": "Важна только для серверных этажей"
      }
    ],
    "explanation": "Правильный ответ: А) Защищает оборудование, документы и доступы к помещениям;; Б) Предотвращает кражи, повреждения и несанкционированный доступ"
  },
  {
    "id": "T9Q18",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 18,
    "prompt": "Какие правовые и этические аспекты охватывает ИБ?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Защита персональных данных"
      },
      {
        "key": "Б",
        "text": "Ответственность за нарушение законодательства"
      },
      {
        "key": "В",
        "text": "Криптографическая защита"
      },
      {
        "key": "Г",
        "text": "Никаких правовых аспектов"
      },
      {
        "key": "Д",
        "text": "Обеспечение безопасности государственных и корпоративных данных"
      }
    ],
    "explanation": "Правильный ответ: А) Защита персональных данных; Б) Ответственность за нарушение законодательства; Д) Обеспечение безопасности государственных и корпоративных данных"
  },
  {
    "id": "T9Q19",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 19,
    "prompt": "Какие из перечисленных технологий защиты обычно применяются в ИБ?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Антивирусы/EDR"
      },
      {
        "key": "Б",
        "text": "Системы контроля дорожного траффика"
      },
      {
        "key": "В",
        "text": "Шифрование"
      },
      {
        "key": "Г",
        "text": "VPN"
      },
      {
        "key": "Д",
        "text": "IDS/IPS"
      }
    ],
    "explanation": "Правильный ответ: А) Антивирусы/EDR; В) Шифрование; Г) VPN; Д) IDS/IPS"
  },
  {
    "id": "T9Q20",
    "topic": 9,
    "topicTitle": "Информационная безопасность",
    "number": 20,
    "prompt": "Какой метод применим для обеспечения безопасности облака?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "В облаке не требуется никакой настройки безопасности"
      },
      {
        "key": "Б",
        "text": "Метод разделения ответственности"
      },
      {
        "key": "В",
        "text": "Резервное копирование 3-2-1"
      },
      {
        "key": "Г",
        "text": "Облако полностью автономно безопасно без контроля пользователя"
      },
      {
        "key": "Д",
        "text": "Антивирусы/EDR"
      }
    ],
    "explanation": "Правильный ответ: Б) Метод разделения ответственности"
  },
  {
    "id": "T10Q1",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 1,
    "prompt": "Что понимается под термином «Конфиденциальность данных»?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Публичное использование данных"
      },
      {
        "key": "Б",
        "text": "Ограничение доступа к личным данным"
      },
      {
        "key": "В",
        "text": "Публикация данных в интернете"
      },
      {
        "key": "Г",
        "text": "Продажа данных третьим лицам"
      },
      {
        "key": "Д",
        "text": "Данные удаляются автоматически"
      }
    ],
    "explanation": "Правильный ответ: Б) Ограничение доступа к личным данным"
  },
  {
    "id": "T10Q2",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 2,
    "prompt": "Какой принцип этики данных требует информировать пользователя о сборе его данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Анонимность"
      },
      {
        "key": "Б",
        "text": "Прозрачность"
      },
      {
        "key": "В",
        "text": "Манипуляция"
      },
      {
        "key": "Г",
        "text": "Скрытность"
      },
      {
        "key": "Д",
        "text": "Гласность"
      }
    ],
    "explanation": "Правильный ответ: Б) Прозрачность"
  },
  {
    "id": "T10Q3",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 3,
    "prompt": "Какие данные считаются персональными?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "В"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Любые общедоступные данные"
      },
      {
        "key": "Б",
        "text": "Только адреса электронной почты"
      },
      {
        "key": "В",
        "text": "Информация, позволяющая идентифицировать личность"
      },
      {
        "key": "Г",
        "text": "Настройки браузера"
      },
      {
        "key": "Д",
        "text": "Информация ограниченного доступа"
      }
    ],
    "explanation": "Правильный ответ: В) Информация, позволяющая идентифицировать личность"
  },
  {
    "id": "T10Q4",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 4,
    "prompt": "Что запрещено делать с персональными данными без согласия субъекта?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Хранить их на сервере"
      },
      {
        "key": "Б",
        "text": "Обрабатывать и анализировать"
      },
      {
        "key": "В",
        "text": "Передавать третьим лицам"
      },
      {
        "key": "Г",
        "text": "Сохранять резервные копии"
      },
      {
        "key": "Д",
        "text": "Хранить их без ограничения времени"
      }
    ],
    "explanation": "Правильный ответ: А) Хранить их на сервере; Б) Обрабатывать и анализировать; В) Передавать третьим лицам; Г) Сохранять резервные копии; Д) Хранить их без ограничения времени"
  },
  {
    "id": "T10Q5",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 5,
    "prompt": "Что должен сделать разработчик, если обнаружил утечку персональных данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Игнорировать и не информировать никого"
      },
      {
        "key": "Б",
        "text": "Сообщить пользователям и принять меры для устранения утечки"
      },
      {
        "key": "В",
        "text": "Удалить все данные без объяснения"
      },
      {
        "key": "Г",
        "text": "Удалить все данные, проинформировав об этом пользователей"
      },
      {
        "key": "Д",
        "text": "Создать резервную копию"
      }
    ],
    "explanation": "Правильный ответ: Б) Сообщить пользователям и принять меры для устранения утечки"
  },
  {
    "id": "T10Q6",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 6,
    "prompt": "Какое действие нарушает этические нормы использования данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "В"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Запрашивать согласие на обработку"
      },
      {
        "key": "Б",
        "text": "Использовать обезличенные данные"
      },
      {
        "key": "В",
        "text": "Продавать данные без согласия пользователя"
      },
      {
        "key": "Г",
        "text": "Ограничивать доступ к личной информации"
      },
      {
        "key": "Д",
        "text": "Шифровать данные при передаче"
      }
    ],
    "explanation": "Правильный ответ: В) Продавать данные без согласия пользователя"
  },
  {
    "id": "T10Q7",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 7,
    "prompt": "Что из ниже перечисленного относится к этике данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Конфиденциальность"
      },
      {
        "key": "Б",
        "text": "Честность и прозрачность"
      },
      {
        "key": "В",
        "text": "Массовое несанкционированное распространение данных"
      },
      {
        "key": "Г",
        "text": "Ответственность за данные"
      },
      {
        "key": "Д",
        "text": "Уважение к правам субъектов"
      }
    ],
    "explanation": "Правильный ответ: А) Конфиденциальность"
  },
  {
    "id": "T10Q8",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 8,
    "prompt": "Какое из следующих утверждений наиболее полно отражает суть принципа конфиденциальности в сфере обработки данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "В"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Ограничение доступа к пользовательским данным исключительно техническими средствами"
      },
      {
        "key": "Б",
        "text": "Исключение любого обмена данными между организациями без уведомления пользователя"
      },
      {
        "key": "В",
        "text": "Контроль и управление доступом к персональной информации с учётом прав и интересов субъекта данных"
      },
      {
        "key": "Г",
        "text": "Публичная публикация обезличенных данных без консенсуса с пользователем"
      },
      {
        "key": "Д",
        "text": "Обезличивание всей массы данных"
      }
    ],
    "explanation": "Правильный ответ: В) Контроль и управление доступом к персональной информации с учётом прав и интересов субъекта данных"
  },
  {
    "id": "T10Q9",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 9,
    "prompt": "Что из перечисленного является частью практики \"privacy by design\" (конфиденциальность по умолчанию)?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Внедрение мер защиты данных на этапе проектирования системы"
      },
      {
        "key": "Б",
        "text": "Постоянное обновление систем безопасности"
      },
      {
        "key": "В",
        "text": "Обработка данных без учета конфиденциальности"
      },
      {
        "key": "Г",
        "text": "Минимизация сбора персональных данных"
      },
      {
        "key": "Д",
        "text": "Встроенная автоматическая защита данных"
      }
    ],
    "explanation": "Правильный ответ: А) Внедрение мер защиты данных на этапе проектирования системы"
  },
  {
    "id": "T10Q10",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 10,
    "prompt": "В каком случае организация будет нарушать этические нормы при передаче персональных данных третьим сторонам?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "В"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "При передаче данных с получением информированного согласия и заключением договора о конфиденциальности"
      },
      {
        "key": "Б",
        "text": "При передаче данных в обезличенном виде для научных исследований"
      },
      {
        "key": "В",
        "text": "При продаже данных без уведомления и согласия субъектов данных"
      },
      {
        "key": "Г",
        "text": "При обеспечении технической безопасности передачи данных"
      },
      {
        "key": "Д",
        "text": "При передаче общедоступных данных"
      }
    ],
    "explanation": "Правильный ответ: В) При продаже данных без уведомления и согласия субъектов данных"
  },
  {
    "id": "T10Q11",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 11,
    "prompt": "Какая ключевая проблема возникает при использовании модели искусственного интеллекта без учёта этического контекста?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "В"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Увеличение скорости обработки данных"
      },
      {
        "key": "Б",
        "text": "Технические сбои в работе оборудования"
      },
      {
        "key": "В",
        "text": "Потенциальное искажение решений и усиление дискриминации"
      },
      {
        "key": "Г",
        "text": "Автоматическая генерация случайных данных"
      },
      {
        "key": "Д",
        "text": "Генерация больших объемов данных"
      }
    ],
    "explanation": "Правильный ответ: В) Потенциальное искажение решений и усиление дискриминации"
  },
  {
    "id": "T10Q12",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 12,
    "prompt": "Каким образом компании могут обеспечить соблюдение принципа прозрачности при использовании пользовательских данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Сокрытием целей обработки данных от пользователей"
      },
      {
        "key": "Б",
        "text": "Предоставлением пользователям понятной информации о том, какие данные собираются и как используются"
      },
      {
        "key": "В",
        "text": "Игнорированием запросов пользователей о доступе к их данным"
      },
      {
        "key": "Г",
        "text": "Автоматической продаже данных партнёрам без уведомления"
      },
      {
        "key": "Д",
        "text": "Внедрением мер защиты данных на этапе проектирования системы"
      }
    ],
    "explanation": "Правильный ответ: Б) Предоставлением пользователям понятной информации о том, какие данные собираются и как используются"
  },
  {
    "id": "T10Q13",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 13,
    "prompt": "В чем причина важности учета вопросов этики при сборе данных в проектах, связанных с биометрией?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Биометрические данные невозможно использовать для идентификации"
      },
      {
        "key": "Б",
        "text": "Биометрические данные считаются особо чувствительными и требуют усиленной защиты и согласия"
      },
      {
        "key": "В",
        "text": "Биометрические данные всегда обезличены по умолчанию"
      },
      {
        "key": "Г",
        "text": "Биометрические данные не подпадают под регулирование законов о персональных данных"
      },
      {
        "key": "Д",
        "text": "Биометрические данные невозможно хранить до достижения цели обработки"
      }
    ],
    "explanation": "Правильный ответ: Б) Биометрические данные считаются особо чувствительными и требуют усиленной защиты и согласия"
  },
  {
    "id": "T10Q14",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 14,
    "prompt": "Какие из подходов соответствуют этическим нормам при хранении и передаче персональных данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "Г",
      "Д"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Использование шифрования и протоколов безопасности при передаче"
      },
      {
        "key": "Б",
        "text": "Ограничение доступа к данным на основе ролей и полномочий"
      },
      {
        "key": "В",
        "text": "Хранение данных в открытом виде в публичных репозиториях без ограничений"
      },
      {
        "key": "Г",
        "text": "Регулярный аудит и обновление мер безопасности"
      },
      {
        "key": "Д",
        "text": "Информирование субъектов о целях передачи и хранения"
      }
    ],
    "explanation": "Правильный ответ: А) Использование шифрования и протоколов безопасности при передаче; Б) Ограничение доступа к данным на основе ролей и полномочий; Г) Регулярный аудит и обновление мер безопасности; Д) Информирование субъектов о целях передачи и хранения"
  },
  {
    "id": "T10Q15",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 15,
    "prompt": "В чем заключается этическая ответственность разработчиков приложений, собирающих персональные данные?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Максимальное расширение аудитории за счёт всех доступных данных"
      },
      {
        "key": "Б",
        "text": "Обеспечение безопасности, прозрачности и возможности контроля для пользователей"
      },
      {
        "key": "В",
        "text": "Использование данных для агрессивной рекламы без ограничения"
      },
      {
        "key": "Г",
        "text": "Игнорирование отзывов пользователей о конфиденциальности"
      },
      {
        "key": "Д",
        "text": "В получении данных пользователей обманным путем"
      }
    ],
    "explanation": "Правильный ответ: Б) Обеспечение безопасности, прозрачности и возможности контроля для пользователей"
  },
  {
    "id": "T10Q16",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 16,
    "prompt": "При каких условиях использование данных для создания профилей пользователей считается этически допустимым?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Когда профили создаются без уведомления и согласия пользователей"
      },
      {
        "key": "Б",
        "text": "Когда использование данных соответствует заявленным целям, пользователь информирован и дал согласие"
      },
      {
        "key": "В",
        "text": "Когда данные используются исключительно для рекламы без ограничений"
      },
      {
        "key": "Г",
        "text": "Когда данные собираются и сохраняются бессрочно без контроля"
      },
      {
        "key": "Д",
        "text": "Когда хранение данных производится в открытом виде"
      }
    ],
    "explanation": "Правильный ответ: Б) Когда использование данных соответствует заявленным целям, пользователь информирован и дал согласие"
  },
  {
    "id": "T10Q17",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 17,
    "prompt": "Почему важно получать информированное согласие на обработку данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Это формальность, которую можно игнорировать"
      },
      {
        "key": "Б",
        "text": "Для защиты прав пользователя и соблюдения законов"
      },
      {
        "key": "В",
        "text": "Чтобы ускорить сбор данных"
      },
      {
        "key": "Г",
        "text": "Чтобы скрыть от пользователя процесс обработки"
      },
      {
        "key": "Д",
        "text": "Для обеспечения безопасности руководства"
      }
    ],
    "explanation": "Правильный ответ: Б) Для защиты прав пользователя и соблюдения законов"
  },
  {
    "id": "T10Q18",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 18,
    "prompt": "Какая из практик считается этичной при использовании данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Использование данных только для заявленных целей"
      },
      {
        "key": "Б",
        "text": "Использование данных для скрытой рекламы без согласия"
      },
      {
        "key": "В",
        "text": "Продажа данных без уведомления владельцев"
      },
      {
        "key": "Г",
        "text": "Изменение данных для улучшения отчётов"
      },
      {
        "key": "Д",
        "text": "Обезличивание данных при передаче"
      }
    ],
    "explanation": "Правильный ответ: А) Использование данных только для заявленных целей"
  },
  {
    "id": "T10Q19",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 19,
    "prompt": "Какое из следующих утверждений отражает правильный подход к хранению данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Хранить данные навсегда без ограничений"
      },
      {
        "key": "Б",
        "text": "Хранить данные ровно столько, сколько это необходимо"
      },
      {
        "key": "В",
        "text": "Не создавать резервных копий данных"
      },
      {
        "key": "Г",
        "text": "Делать данные общедоступными без ограничения"
      },
      {
        "key": "Д",
        "text": "Передавать данные по открытым каналам"
      }
    ],
    "explanation": "Правильный ответ: Б) Хранить данные ровно столько, сколько это необходимо"
  },
  {
    "id": "T10Q20",
    "topic": 10,
    "topicTitle": "Этика данных",
    "number": 20,
    "prompt": "Какая из технологий позволяет обеспечивать анонимность данных?",
    "sourceType": "Выберите несколько правильных ответов",
    "answer": [
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Шифрование"
      },
      {
        "key": "Б",
        "text": "Маскирование данных"
      },
      {
        "key": "В",
        "text": "Обезличивание данных"
      },
      {
        "key": "Г",
        "text": "Псевдонимизация данных"
      },
      {
        "key": "Д",
        "text": "Использование VPN для доступа к данным"
      }
    ],
    "explanation": "Правильный ответ: Б) Маскирование данных; В) Обезличивание данных; Г) Псевдонимизация данных"
  },
  {
    "id": "T11Q1",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 1,
    "prompt": "Что отличает машинное обучение от «заучивания наизусть»?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Для машины достаточно запомнить обучающую выборку, и этого всегда достаточно для работы на новых данных."
      },
      {
        "key": "Б",
        "text": "Важно, чтобы модель делала выводы, а не просто запоминала примеры."
      },
      {
        "key": "В",
        "text": "Модель должна корректно работать на новых данных."
      },
      {
        "key": "Г",
        "text": "По конечному набору обучающих данных модель должна научиться обобщать."
      },
      {
        "key": "Д",
        "text": "Главная цель ML - исключить необходимость в данных."
      }
    ],
    "explanation": "Правильный ответ: Б) Важно, чтобы модель делала выводы, а не просто запоминала примеры.; В) Модель должна корректно работать на новых данных.; Г) По конечному набору обучающих данных модель должна научиться обобщать."
  },
  {
    "id": "T11Q2",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 2,
    "prompt": "Какой вариант отражает выбор приоритета при построении ML-системы: улучшать в первую очередь алгоритм или входную информацию?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Классификация и регрессия"
      },
      {
        "key": "Б",
        "text": "Фокус на модели и фокус на данных"
      },
      {
        "key": "В",
        "text": "Обучение с учителем и обучение без учителя"
      },
      {
        "key": "Г",
        "text": "Переобучение и недообучение"
      },
      {
        "key": "Д",
        "text": "ETL-пайплайн и BI-отчетность"
      }
    ],
    "explanation": "Правильный ответ: Б) Фокус на модели и фокус на данных"
  },
  {
    "id": "T11Q3",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 3,
    "prompt": "Какой ориентировочный объем времени в ML-процессе уходит на подготовку данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Г"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "До 20%"
      },
      {
        "key": "Б",
        "text": "До 40%"
      },
      {
        "key": "В",
        "text": "До 60%"
      },
      {
        "key": "Г",
        "text": "До 80%"
      },
      {
        "key": "Д",
        "text": "До 95%"
      }
    ],
    "explanation": "Правильный ответ: Г) До 80%"
  },
  {
    "id": "T11Q4",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 4,
    "prompt": "Что относится к этапу «Сбор и хранение данных»?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Сбор данных из возможных источников максимально своевременно"
      },
      {
        "key": "Б",
        "text": "Настройка хранилища данных"
      },
      {
        "key": "В",
        "text": "Хранение метаданных"
      },
      {
        "key": "Г",
        "text": "Версионирование данных"
      },
      {
        "key": "Д",
        "text": "Полный отказ от контроля источников"
      }
    ],
    "explanation": "Правильный ответ: А) Сбор данных из возможных источников максимально своевременно; Б) Настройка хранилища данных; В) Хранение метаданных; Г) Версионирование данных"
  },
  {
    "id": "T11Q5",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 5,
    "prompt": "Какие сложности характерны для этапа разметки данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Высокие затраты времени и труда"
      },
      {
        "key": "Б",
        "text": "Необходимость экспертных знаний"
      },
      {
        "key": "В",
        "text": "Риск несогласованности"
      },
      {
        "key": "Г",
        "text": "Риск ошибок"
      },
      {
        "key": "Д",
        "text": "Гарантированно низкая стоимость и отсутствие рисков"
      }
    ],
    "explanation": "Правильный ответ: А) Высокие затраты времени и труда; Б) Необходимость экспертных знаний; В) Риск несогласованности; Г) Риск ошибок"
  },
  {
    "id": "T11Q6",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 6,
    "prompt": "Какое действие напрямую повышает качество разметки данных?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Проверка согласованности и корректности размеченных примеров"
      },
      {
        "key": "Б",
        "text": "Уменьшение числа проверок разметки до минимума"
      },
      {
        "key": "В",
        "text": "Удаление всех сложных случаев до начала обучения"
      },
      {
        "key": "Г",
        "text": "Применение модели без этапа валидации разметки"
      },
      {
        "key": "Д",
        "text": "Отказ от единых инструкция для разметки данных"
      }
    ],
    "explanation": "Правильный ответ: А) Проверка согласованности и корректности размеченных примеров"
  },
  {
    "id": "T11Q7",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 7,
    "prompt": "Какие данные используются в банковских рекомендательных системах для персонализации продуктов?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "История операций клиента"
      },
      {
        "key": "Б",
        "text": "Кредитная история"
      },
      {
        "key": "В",
        "text": "Информация о доходах"
      },
      {
        "key": "Г",
        "text": "Аватар клиента в приложении"
      },
      {
        "key": "Д",
        "text": "Частота обновления обоев на рабочем столе клиента"
      }
    ],
    "explanation": "Правильный ответ: А) История операций клиента; Б) Кредитная история; В) Информация о доходах"
  },
  {
    "id": "T11Q8",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 8,
    "prompt": "Какая задача относится к применению ML в банковских рекомендательных системах?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Персональный подбор финансовых продуктов для клиента"
      },
      {
        "key": "Б",
        "text": "Генерация новых валютных курсов на бирже"
      },
      {
        "key": "В",
        "text": "Замена всех сотрудников службы поддержки"
      },
      {
        "key": "Г",
        "text": "Полный отказ от проверки клиентских операций"
      },
      {
        "key": "Д",
        "text": "Назначение пароля клиенту случайным образом без политики безопасности"
      }
    ],
    "explanation": "Правильный ответ: А) Персональный подбор финансовых продуктов для клиента"
  },
  {
    "id": "T11Q9",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 9,
    "prompt": "Как ML-системы помогают предотвращать мошенничество в банке?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Отслеживают аномальные транзакции"
      },
      {
        "key": "Б",
        "text": "Могут попросить клиента подтвердить операцию"
      },
      {
        "key": "В",
        "text": "Могут временно блокировать карту"
      },
      {
        "key": "Г",
        "text": "Удаляют все крупные платежи без анализа"
      },
      {
        "key": "Д",
        "text": "Одобряют любые операции без анализа поведения"
      }
    ],
    "explanation": "Правильный ответ: А) Отслеживают аномальные транзакции; Б) Могут попросить клиента подтвердить операцию; В) Могут временно блокировать карту"
  },
  {
    "id": "T11Q10",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 10,
    "prompt": "Что является примером прогнозирования в банковском ML-контуре?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Подбор рекламного баннера по цвету интерфейса"
      },
      {
        "key": "Б",
        "text": "Прогноз вероятности дефолта заемщика"
      },
      {
        "key": "В",
        "text": "Случайная выдача кредитного лимита"
      },
      {
        "key": "Г",
        "text": "Удаление истории операций клиента"
      },
      {
        "key": "Д",
        "text": "Смена ПИН-кода по фиксированному расписанию без анализа данных"
      }
    ],
    "explanation": "Правильный ответ: Б) Прогноз вероятности дефолта заемщика"
  },
  {
    "id": "T11Q11",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 11,
    "prompt": "Установите соответствие банковской задачи (колонка 1) и ее описания (колонка 2)?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Кредитный скоринг",
        "right": "Оценка вероятности дефолта заемщика по данным клиента"
      },
      {
        "key": "Б",
        "left": "Прогнозирование оттока клиентов",
        "right": "Выявление клиентов, склонных уйти к конкурентам"
      },
      {
        "key": "В",
        "left": "Прогноз рыночных рисков",
        "right": "Предсказание колебаний курсов, ставок и стоимости активов"
      },
      {
        "key": "Г",
        "left": "Оптимизация ликвидности",
        "right": "Прогноз денежных потоков для поддержания резервов"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  },
  {
    "id": "T11Q12",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 12,
    "prompt": "Какие основные проблемы качества данных наиболее часто встречаются в ML-проектах?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Неполнота данных"
      },
      {
        "key": "Б",
        "text": "Смещение (bias)"
      },
      {
        "key": "В",
        "text": "Шум и ошибки"
      },
      {
        "key": "Г",
        "text": "Неактуальность данных"
      },
      {
        "key": "Д",
        "text": "Полная однородность и непротиворечивость данных"
      }
    ],
    "explanation": "Правильный ответ: А) Неполнота данных; Б) Смещение (bias); В) Шум и ошибки; Г) Неактуальность данных"
  },
  {
    "id": "T11Q13",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 13,
    "prompt": "Какой показатель в наибольшей степени указывает на неактуальность данных в ML-задаче?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Данные отражают текущий год и последние изменения поведения клиентов"
      },
      {
        "key": "Б",
        "text": "В обучении используются в основном сильно устаревшие записи"
      },
      {
        "key": "В",
        "text": "В выборке есть числовые и категориальные признаки одновременно"
      },
      {
        "key": "Г",
        "text": "Данные хранятся в централизованном хранилище"
      },
      {
        "key": "Д",
        "text": "Наличие в одном наборе признаков данных разных типов (строковых и числовых)"
      }
    ],
    "explanation": "Правильный ответ: Б) В обучении используются в основном сильно устаревшие записи"
  },
  {
    "id": "T11Q14",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 14,
    "prompt": "Какие подходы могут быть использованы для обработки пропущенных значений во входных данных?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Заполнение средним/медианой для числовых данных"
      },
      {
        "key": "Б",
        "text": "Предсказание пропусков ML-моделями"
      },
      {
        "key": "В",
        "text": "Игнорировать пропуски при любом масштабе проблемы"
      },
      {
        "key": "Г",
        "text": "Заполнять все пропуски случайными буквами"
      },
      {
        "key": "Д",
        "text": "Удалять весь датасет при обнаружении любого пропуска"
      }
    ],
    "explanation": "Правильный ответ: А) Заполнение средним/медианой для числовых данных; Б) Предсказание пропусков ML-моделями"
  },
  {
    "id": "T11Q15",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 15,
    "prompt": "Какие методы можно использовать для устранения в данных шума и аномалий?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Фильтрация через правила/пороговые значения"
      },
      {
        "key": "Б",
        "text": "Полное отключение проверки качества данных"
      },
      {
        "key": "В",
        "text": "Полный запрет на сбор новых данных"
      },
      {
        "key": "Г",
        "text": "Аномалии оставлять без проверки, чтобы сохранить разнообразие"
      },
      {
        "key": "Д",
        "text": "Исключить все числовые признаки из набора данных"
      }
    ],
    "explanation": "Правильный ответ: А) Фильтрация через правила/пороговые значения"
  },
  {
    "id": "T11Q16",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 16,
    "prompt": "Какой подход помогает снизить смещение данных при формировании обучающей выборки?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "А"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Стратифицированная выборка (формирование подвыборок с сохранением долей ключевых групп)"
      },
      {
        "key": "Б",
        "text": "Полное исключение недопредставленных групп из выборки"
      },
      {
        "key": "В",
        "text": "Увеличение дисбаланса выборки в пользу одной группы"
      },
      {
        "key": "Г",
        "text": "Игнорирование репрезентативности при формировании выборки"
      },
      {
        "key": "Д",
        "text": "Случайное удаление признаков, связанных с поведением клиентов"
      }
    ],
    "explanation": "Правильный ответ: А) Стратифицированная выборка (формирование подвыборок с сохранением долей ключевых групп)"
  },
  {
    "id": "T11Q17",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 17,
    "prompt": "Какие категории рисков ИИ выделяют при анализе безопасности и управления ИИ-системами?",
    "sourceType": "Выберите один или несколько правильных ответов",
    "answer": [
      "А",
      "Б",
      "В",
      "Г"
    ],
    "type": "multiple",
    "options": [
      {
        "key": "А",
        "text": "Злонамеренное использование"
      },
      {
        "key": "Б",
        "text": "ИИ-гонка"
      },
      {
        "key": "В",
        "text": "Организационные риски"
      },
      {
        "key": "Г",
        "text": "Мятежные ИИ (проблема контроля)"
      },
      {
        "key": "Д",
        "text": "Исключительно риски печати документов"
      }
    ],
    "explanation": "Правильный ответ: А) Злонамеренное использование; Б) ИИ-гонка; В) Организационные риски; Г) Мятежные ИИ (проблема контроля)"
  },
  {
    "id": "T11Q18",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 18,
    "prompt": "Какой риск связан с конкурентным давлением между разработчиками ИИ-систем?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Риск того, что модели начнут автоматически исправлять все ошибки данных"
      },
      {
        "key": "Б",
        "text": "Риск ускоренного развертывания небезопасных решений"
      },
      {
        "key": "В",
        "text": "Риск того, что ИИ полностью отменит потребность в кибербезопасности"
      },
      {
        "key": "Г",
        "text": "Риск полного исчезновения организационных процессов"
      },
      {
        "key": "Д",
        "text": "Риск того, что ИИ всегда будет работать только в онлайн-режиме"
      }
    ],
    "explanation": "Правильный ответ: Б) Риск ускоренного развертывания небезопасных решений"
  },
  {
    "id": "T11Q19",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 19,
    "prompt": "Какой организационный шаг помогает снизить вероятность катастрофических инцидентов в ИИ- системах?",
    "sourceType": "Выберите один правильный ответ",
    "answer": [
      "Б"
    ],
    "type": "single",
    "options": [
      {
        "key": "А",
        "text": "Отказ от внутренних проверок ради скорости запуска"
      },
      {
        "key": "Б",
        "text": "Внутренний аудит и процедуры риск-менеджмента"
      },
      {
        "key": "В",
        "text": "Сокрытие инцидентов от команды эксплуатации"
      },
      {
        "key": "Г",
        "text": "Полная передача решений ИИ без контроля человека"
      },
      {
        "key": "Д",
        "text": "Полный отказ от обучения сотрудников по вопросам ИИ-рисков"
      }
    ],
    "explanation": "Правильный ответ: Б) Внутренний аудит и процедуры риск-менеджмента"
  },
  {
    "id": "T11Q20",
    "topic": 11,
    "topicTitle": "Big Data и искусственный интеллект",
    "number": 20,
    "prompt": "Установите соответствие категории риска (колонка 1) и ее примера (колонка 2)?",
    "sourceType": "Сопоставьте значения из левой и правой колонок",
    "type": "match",
    "pairs": [
      {
        "key": "А",
        "left": "Злонамеренное использование",
        "right": "Биотерроризм и персонализированная дезинформация"
      },
      {
        "key": "Б",
        "left": "ИИ-гонка",
        "right": "Конкурентное давление и небезопасное развертывание систем"
      },
      {
        "key": "В",
        "left": "Организационные риски",
        "right": "Управление сложными системами и необходимость аудита/риск-менеджмента"
      }
    ],
    "explanation": "В задании нужно восстановить соответствие между понятиями и их описаниями."
  }
];
